[
  {
    "title": "Legislative Prerogative Act",
    "sponsor": "",
    "author": "Senate President Pro Tempore Noah Fineberg",
    "summary": "All bills of law, resolutions, authorizations, and special requests must be submitted to the chair of the committee assigned to hear that type of legislation by a Student Senator.",
    "id": "SSB 2022-1000",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Constitutional Powers Act - 200 Code Revision",
    "sponsor": "",
    "author": "Senate President Pro-Tempore Noah Fineberg",
    "summary": "Student Senate 3000 J. Wayne Reitz Union PO Box 118505 Gainesville, FL 32611 352-392-1665 STUDENT SENATE BILL 2022-1001 TITLE: Constitutional Powers Act - 200 Code Revision AUTHOR(S): Senate President Pro-Tempore Noah Fineberg SPONSOR(S): CHAPTER 210 EXECUTIVE BRANCH OFFICIALS ESTABLISHMENACTT (2000-120, 2000-130, 2001- 135, 2002-118, 2003-115, 2004-132, 2005-108, 2005-121, 2006-116, 2007-106, 2007-116, 2009-111, 2009- 114, 2010-118, 2011-109, 201 1-110, 2011-114, 2012-106, 2013-101, 2015-105, 2016-105, 2017-105, 2019- 109, 2020-1013, 2020-1020, 2021-115) 210.1 The Executive Branch Officials are responsible to the Student Body President, Student Body Vice President, and Student Body Treasurer in whose name each Executive Branch Official acts.",
    "id": "SSB 2022-1001",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Recognizing and Upholding the Zero Waste Mission Commitment",
    "sponsor": "Deputy Minority Party Leader Faith Corbett, Senator Oscar Santiago, Senator Spencer Gorelick, Senator Adrianne Weston, Senator Lila Terner, Senator Hiba Karim, Judiciary Chairwoman Casey Mason, Senate President Pro-Tempore Fineberg, Senate President Groux, Judiciary Vice Chair Sean Harkins, Majority Party Leader John Brinkman, Senator Andrew Priest, Senator Ryan Rosenfelt, Senator Mason Solomon, Senator Taylor Soukup",
    "author": "Minority Party Leader Gabrielle Adekunle",
    "summary": "On August 31st, 2021, the City of Gainesville Zero Waste Subcommittee implemented an updated solid waste ordinance to further their zero waste mission. This resolution recognizes and upholds the commitment to the zero waste mission. This commitment is aimed at reducing waste, promoting recycling, and ensuring sustainability within the city. The resolution acknowledges the efforts of the City of Gainesville in addressing and implementing this ordinance. It also encourages residents, businesses, and organizations to actively participate in achieving the city's zero waste goals. By passing this resolution, the Student Senate shows support and commitment to the efforts of the City of Gainesville towards achieving a sustainable and environmentally-friendly community.",
    "id": "SSB 2022-1002",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Commemorating Black History Month",
    "sponsor": "Deputy Minority Party Leader Faith Corbett, Rules & Ethics Chairwoman Camille Consolo, Senator Oscar Santiago, Senator Olivia Green, Senator Spencer Gorelick, Senator Connor Panish, Senator Ethan Sawyer, Senator Andrew Fenning, Senator Kyle Fohrman, Senator Adrianne Weston, Senator Brendan Lamboglia, Judiciary Vice Chair Sean Harkins",
    "author": "Minority Party Leader Gabrielle Adekunle",
    "summary": "Each February commemorates Black History Month, a period which honors and appreciates the rich culture, history and contributions of Black and African Americans.",
    "id": "SSB 2022-1003",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Exclusionary Offices Modernization Act - 100 Codes Amendment",
    "sponsor": "Minority Party Leader Gabrielle Adekunie, Deputy Minority Party Leader Faith Corbett, Senator Spencer Gorelick, Senator Connor Panish",
    "author": "Senator Oscar Santiago",
    "summary": "The Exclusionary Offices Modernization Act - 100 Codes Amendment aims to amend Chapter 130 of the Exclusionary Offices Act to update and modernize the list of exclusionary offices in the Executive Branch. The amendment includes additions and revisions to the list of exclusive offices, such as Student Body President, Student Body Vice President, Student Body Treasurer, Assistant Treasurer(s), Executive Secretary, etc. The purpose of this amendment is to ensure that the list of exclusionary offices accurately reflects the current structure and needs of the Student Senate and Executive Branch.",
    "id": "SSB 2022-1004",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning the ‘Don’t Say Gay’ Bill",
    "sponsor": "Senator Grace Shoemaker, Senator Connor Panish, Senator Hiba Karim, Senator Savanah Partridge, Senator Faith Corbett, Senator Gabriela Montes, Senator Joshua Riklan, Senator Olivia Fernandez, Senator David Zepeda, Senator John Brinkman, Senator Sean Harkins, Senator Phoebe Funai, Senator Alex Aldazabal, Senator Tanner Thompson, Senator Shannon Locasio, Senator Mara Vaknin, Majority Party Leader Emily Pecora",
    "author": "Minority Party Leader Gabrielle Adekunle, Deputy Minority Party Leader Spencer Gorelick, Senator Oscar Santiago, Senator Cassie Urbenz, Senator Adrienne Weston",
    "summary": "",
    "id": "SSB 2022-1005",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Project ReOrganization (PRO) Act",
    "sponsor": "Student Body President Cooper Brown, Majority Party Leader Emily Pecora, Senate President Lizzie Hartzog, Senate President Pro-Tempore Olivia Green, Senator Giordano",
    "author": "Judiciary Vice Chair Sean Harkins, Senator John Brinkman",
    "summary": "Student Senate Bill 2022-1006, titled the Project ReOrganization (PRO) Act, is authored by Judiciary Vice Chair Sean Harkins and Senator John Brinkman. The bill is sponsored by Student Body President Cooper Brown, Majority Party Leader Emily Pecora, Senate President Lizzie Hartzog, Senate President Pro-Tempore Olivia Green, and Senator Giordano. The bill proposes amendments to Chapter 210 of the Student Senate's rules, specifically addressing the Executive Branch Officials. The purpose of the PRO Act is to reorganize and streamline the roles and responsibilities of the Executive Branch Officials to improve efficiency and effectiveness within the Student Senate.",
    "id": "SSB 2022-1006",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Recognizing May as Mental Health Awareness Month 2022",
    "sponsor": "Senator Connor Panish, Senator Cassie Urbenz, Senator Faith Corbett, Minority\nParty Leader Gabrielle Adekunle",
    "author": "Senator Gabriela Montes, Senator Oscar Santiago",
    "summary": "In 1949, the Mental Health America Organization designated the month of May as “Mental Health Awareness Month”. The purpose of this month is to increase awareness of the importance of mental health and wellness in Americans' lives, and to celebrate recovery from mental illness. The bill recognizes May as Mental Health Awareness Month in 2022.",
    "id": "SSB 2022-1008",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Acknowledging the Conclusion of Asian Pacific Islander Desi American (APIDA) Heritage Month",
    "sponsor": "Senate President Elizabeth Hartzog, Senate President Pro-Tempore Olivia Green, Judiciary Chairman John Brinkman, Budget and Appropriations Chairwoman Catherine Giordano, Majority Party Leader Emily Pecora, Senator Krish Talati, Senator Aneesh Chatrathi, Senator Hana Ali, Senator Anjali Natarajan, Senator Ryan Athay, Senator Johnny Liu, Senator Timothy Shin",
    "author": "Senator Saketh Damera",
    "summary": "As designated by the Government of the United States of America, APIDA Heritage Month is observed and celebrated during the month of May. The Student Senate acknowledges the conclusion of this important month and recognizes the contributions, achievements, and cultural diversity of the Asian Pacific Islander Desi American community. Through this resolution, the Senate expresses its support for the APIDA community and commits to promoting inclusivity, understanding, and awareness within the university. The Senate encourages continued education and engagement in order to foster a more inclusive and equitable campus environment. ",
    "id": "SSB 2022-1010",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Celebrating Pride Month 2022 and LGBTQ+ Students, Faculty, and Staff",
    "sponsor": "Senate President Elizabeth Hartzog, Senate President Pro-Tempore Olivia Green, Budget and Appropriations Chairwoman Catherine Giordano, Rules and Ethics Chairwoman Tanner Thompson, Information and Communications Chairwoman Phoebe Funai, Majority Party Leader Emily Pecora, Senator Julia Haley, Senator Mara Vaknin, Senator Mason Solomon, Senator Jacey Cable, Senator Taylor Soukup, Member-at-Large Nyla Pierre, Senator Blake Cox, Senat",
    "author": "Student Body Vice President Daniel Badell, Judiciary Chairman John Brinkman",
    "summary": "Resolution Celebrating Pride Month 2022 and LGBTQ+ Students, Faculty, and Staff",
    "id": "SSB 2022-1011",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Endorsing System to Track Parking in Reitz Union Welcome Center Parking Garage",
    "sponsor": "Majority Party Leader Emily Pecora, Information and Communications Chairwoman Phoebe Funai, Rules and Ethics Chairwoman Tanner Thompson, Judiciary Chairman John Brinkman, Budget Chairwoman Catherine Giordano, Member-at-Large Nyla Pierre, Senator Carter Graham, Senator Frederic Gaines, Senator Johnny Liu, Senator Jacey Cable, Senator Mason Solomon, Senator Timothy Shin, Senator Ana Troncoso, Senator Ella George, Senator Charlize Ramos",
    "author": "Senator Bronson Allemand, Senator Annalee Watts",
    "summary": "Resolution Endorsing System to Track Parking in Reitz Union Welcome Center Parking Garage.",
    "id": "SSB 2022-1012",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Memorializing the Lost Lives of the Robb Elementary School Students and Teachers in Uvalde, Texas",
    "sponsor": "Student Body President Lauren Lemasters, Student Body Vice President Daniel Badell, Student Body Treasurer Sierra Kantamneni Senator Johnny Liu, Senator Mara Vaknin, Majority Party Leader Emily Pecora, Member-at-Large Nyla Pierre, Budget and Appropriations Chairwoman Catherine Giordano, Information and Communications Chairwoman Phoebe Funai, Rules and Ethics Chairwoman Tanner Thompson, Senator Mary Hanani",
    "author": "Senate President Elizabeth Hartzog, Senate President Pro-Tempore Olivia Green",
    "summary": "Resolution Memorializing the Lost Lives of the Robb Elementary School Students and Teachers in Uvalde, Texas.",
    "id": "SSB 2022-1013",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Authorization of Special Project Funds to Rollover into FY 22-23",
    "sponsor": "",
    "author": "Senate President Elizabeth Hartzog, Budget and Appropriations Chairwoman CatherineGiordano",
    "summary": "Student Senate Bill 2021-1030 allocated $315,000.00 from the Student GovernmentReserves to assist in the upgrades of the Student Engagement Portal of the J. Wayne Reitz Union;  Student Senate Bill 2021-1031 allocated $1,250,000.00 to provide structural upgrades ofthe J. Wayne Reitz Union, as well as provide new services for students to utilize;",
    "id": "SSB 2022-1014",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for the Expansion of Composting Stations Across Campus",
    "sponsor": "Deputy Minority Party Leader Mohammed Faisal, Minority Party Leader Faith Corbett, Senator Oscar Santiago-Perez",
    "author": "Senator Jonathan C. Stephens, Senator Evan Asuncion",
    "summary": "Composting is the natural process of recycling organic matter, such as leaves and food scraps, into a valuable fertilizer that can enrich soil and plants. The resolution advocates for the expansion of composting stations across the campus.",
    "id": "SSB 2022-1018",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Celebrating 50 Years of Women’s Athletics at the University of Florida",
    "sponsor": "Senator Jonathan Stephens, Senator Oscar Santiago, Senator Raj Mia, Senator Catherine Gomez, Senator Taylor Hoerle, Senator Isabelle Gerzenshtein, Senator Hana Ali, Senator Savanah Partridge, Deputy Minority Party Leader Mohammed Faisal, Member-at-Large Jacey Cable, Judiciary Vice-Chair Mason Solomon, Senator Bronson Allemand, Senator Saketh Damera, Senator Jacob Ka",
    "author": "Senator Evan Asuncion, Women’s Caucus Co-Leader Faith Corbett, Women’s Caucus Co-Leader Catherine Giordano, Senate President Elizabeth Hartzog",
    "summary": "The University of Florida Student Senate celebrates 50 years of Women’s Athletics at the University of Florida. Sponsored by Senator Jonathan Stephens, Senator Oscar Santiago, Senator Raj Mia, Senator Catherine Gomez, Senator Taylor Hoerle, Senator Isabelle Gerzenshtein, Senator Hana Ali, Senator Savanah Partridge, Deputy Minority Party Leader Mohammed Faisal, Member-at-Large Jacey Cable, Judiciary Vice-Chair Mason Solomon, Senator Bronson Allemand, Senator Saketh Damera, Senator Jacob Ka.",
    "id": "SSB 2022-1019",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Senate Meeting Modernization and Reform Act of 2022",
    "sponsor": "Judiciary Vice-Chairman Mason Solomon, Senator Mara Vaknin, Senator Julia Haley, Senator Taylor Soukup, Member-at-Large Jacey Cable, Senator Jagger Leach, Senator Sidney Ruedas",
    "author": "Judiciary Chairman John Brinkman",
    "summary": "This bill, authored by Judiciary Chairman John Brinkman, aims to modernize and reform Senate meetings by proposing amendments to Rule I, which governs the officers of the Senate. The key change includes a revised process for electing the Senate President immediately after validating Senate election results. The bill's objective is to enhance efficiency and transparency in Senate meetings.",
    "id": "SSB 2022-1020",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Amendment Awareness Act - Rules and Procedures Amendment",
    "sponsor": "Senator Evan Asuncion, Senator Jonathan C. Stephens, Senator Ryan Athay, Senator Hana Ali, Senator Anjali Natarajan",
    "author": "Senator Oscar Santiago",
    "summary": "Amendment Awareness Act - Rules and Procedures Amendment. Written amendments to legislation must be submitted to the Senate President and Senate Secretary no later than 11:59 PM ET the day before the meeting of the Senate at which the amendment is to be heard.",
    "id": "SSB 2022-1021",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Supporting the National Action Plan for Energy Efficiency",
    "sponsor": "Senate President Elizabeth Hartzog, Judiciary Chair John Brinkman, Member-at-Large Jacey Cable, Minority Party Leader Faith Corbett, Senator Saketh Damera, Senator Sidney Ruedas, Senator Jonathan C. Stephens, Senator Evan Asuncion, Senator Anjali Natarajan, Senator Samantha Sparks, Senator Bianca Barrios",
    "author": "Senator Ryan Athay",
    "summary": "One of the greatest threats to the environment is global warming which results in irreversible alterations to the ecosystem that impact human health [1]; and the built environment",
    "id": "SSB 2022-1022",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Student Senate Secretary Clerical Intensification Amendment",
    "sponsor": "Minority Party Leader Faith Corbett, Deputy Minority Party Leader Mohammed Faisal",
    "author": "Senator Jonathan C. Stephens",
    "summary": "This bill, titled Student Senate Secretary Clerical Intensification Amendment, is authored by Senator Jonathan C. Stephens. It has Minority Party Leader Faith Corbett and Deputy Minority Party Leader Mohammed Faisal as sponsors. The bill proposes an amendment to the CHAPTER 301 CODING SYSTEM of the Student Senate, which pertains to the labeling and numbering of proposals. The purpose of this amendment is to enhance the clerical process and organization of the Student Senate Secretary's office.",
    "id": "SSB 2022-1024",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Funding for Fiscal Year 2023-2024 Activity and Service Fee Budget",
    "sponsor": "Budget and Appropriations Committee",
    "author": "Budget and Appropriations Chairwoman Catherine Giordano",
    "summary": "This bill, authored by Budget and Appropriations Chairwoman Catherine Giordano, proposes funding for the Fiscal Year 2023-2024 Activity and Service Fee Budget. The total budget is $23,251,863.00, representing a 3% increase. The budget includes allocations for Recreational Sports ($7,506,043.00), Reitz Union ($6,529,681.00), Sorority & Fraternity Life ($720,137.00), Student Activities & Involvement ($1,963,611.00), and Student Government ($6,532,391.00). Within the Recreational Sports budget, there is an increase in personnel funding of $393,703.00 from the previous fiscal year.",
    "id": "SSB 2022-1026",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Censuring Senator Jonathan C. Stephens",
    "sponsor": "Rules and Ethics Committee",
    "author": "Rules and Ethics Chairwoman Tanner Thompson",
    "summary": "During the May 24th, 2022 regular Senate meeting Senator Stephens was observed making a physical hand motion that was interpreted by many as an offensive act toward those who live with disabilities. During the July 5, 2022 regular Senate meeting Senator Stephens once again routinely interrupted the business of the Senate and was issued two warnings by the Senate President. Pursuant to Rule XIII § (1)(a)(ii), Senators may be censured for repeatedly disrupting the business of the Senate.",
    "id": "SSB 2022-1028",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Leadership Update Notice Guarantee Act (LUNGA)",
    "sponsor": "None",
    "author": "Senator Jonathan Chance Stephens",
    "summary": "The Student Senate, with a majority vote, may postpone the approval of appointments by one week to review the applicants. The Student Senate shall not confirm any selection for an exclusionary office or position if the appointing officer has not submitted a resume and application to the Replacement and Agenda Committee for compulsory review of stipulated qualifications prior to the Student Senate.",
    "id": "SSB 2022-1029",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "STUDENT ORGANIZATION FUNDRAISING ACCOUNTS -— 800 CODES",
    "sponsor": "Budget and Appropriations Committee",
    "author": "Budget and Appropriationns Chairwoman Catherine Giordano",
    "summary": "To keep an outside revenue account, student organizations must: Continue to be actively funded through Student Government once per fiscal year. Have at least $50.00 in the outside revenue account at the end of each fiscal year. Actively use the outside revenue account, with at least one transaction within the last two fiscal years.",
    "id": "SSB 2022-1031",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Legislative Branch Exclusionary Offices Amendment - 100 Codes Revision",
    "sponsor": "",
    "author": "Senator Oscar Santiago",
    "summary": "The Legislative Branch Exclusionary Offices Amendment revises the 100 Codes in Chapter 130 of the Exclusionary Offices Act. The amendment includes the exclusionary offices of Student Senator, Senate Secretary, Senate Parliamentarian, and Senate Sergeant-at-Arms.",
    "id": "SSB 2022-1033",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Senate Reapportionment Act of 2023",
    "sponsor": "Judiciary Vice-Chair Mason Solomon, Member-at-Large Jacey Cable, Senator Taylor Soukup, Senator Mara Vaknin, Senator Julia Haley, Senator Sidney Ruedas",
    "author": "Judiciary Chairman John Brinkman",
    "summary": "This bill, authored by Judiciary Chairman John Brinkman, proposes the Senate Reapportionment Act of 2023. The bill aims to modify the apportionment of seats in the Senate. The sponsors of this bill include Judiciary Vice-Chair Mason Solomon, Member-at-Large Jacey Cable, Senator Taylor Soukup, Senator Mara Vaknin, Senator Julia Haley, and Senator Sidney Ruedas.",
    "id": "SSB 2022-1035",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Acknowledging International Student Achievements and Equality Among the Student Body",
    "sponsor": "Minority Party Leader Faith Corbett, Deputy Minority Party Leader Gabriela Montes, Senator Cassandra Urbenz, Senator Oscar Santiago, Senator Ryan Athay",
    "author": "Senator Hana Ali, Senator Grace Shoemaker",
    "summary": "The University of Florida acknowledges the achievements and equality among its international student body, which consists of over 6,000 students from 140 countries. The top six countries of origin for international students are India, China, South Korea, Taiwan, Brazil, and Venezuela. International students often face various challenges, including language barriers, cultural adjustment, and financial burdens. The University of Florida strives to support and empower its international students to ensure their success and inclusivity within the student body. This resolution aims to recognize and appreciate the contributions and accomplishments of international students at the University of Florida.",
    "id": "SSB 2022-1039",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Affirming the Importance of Free Expression and Civil Discourse",
    "sponsor": "Senator Mason Solomon",
    "author": "Judiciary Chairman John Brinkman, Judiciary Vice Chair Sean Harkins, Senator Shelby Schultz, Member-at-Large Jacey Cable",
    "summary": "Florida Board of Governors Chair Syd Kitson established the Board's Civil Discourse Initiative at an address in January 2021, where he expressed concern regarding the steady decline in respectful discourse among those with differing viewpoints and his belief that the university setting could provide a foundation for understanding, learning, and growth in this area. The resolution affirms the importance of free expression and civil discourse and recognizes the value in promoting open dialogue and respectful exchange of ideas. The resolution also calls upon all members of the University of Florida community to uphold these principles and engage in constructive and inclusive conversations.",
    "id": "SSB 2022-1040",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Recognizing October as Breast Cancer Awareness Month",
    "sponsor": "Minority Party Leader Faith Corbett, Deputy Minority Leader Gabriela Montes, Senator Grace Shoemaker, Senate President Elizabeth Hartzog, Senate Pro Tempore Olivia Green, Judiciary Chairman John Brinkman, Budget and Appropriations Chairwoman Catherine Giordano, Rules and Ethics Chairwoman Tanner Thompson, Information and Communications Chairwoman Phoebe Funai, Majority Party Leader Emily Pecora, Member-at-Large Nyla Pierre, Senator Sidney Ruedas, Senator Shelby Schultz, Senator Haley Rubin, Senator Alejandro Hoyos, Senator Sean Ha",
    "author": "Senator Oscar Santiago",
    "summary": "Resolution Recognizing October as Breast Cancer Awareness Month",
    "id": "SSB 2022-1041",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Recognizing the Disability and Mental Health Resource Crisis at the University of Florida",
    "sponsor": "",
    "author": "",
    "summary": "The University of Florida Student Senate recognizes the disability and mental health resource crisis at the university. This resolution aims to bring attention to the lack of resources available to students with disabilities and mental health conditions, and urges the administration to take immediate action to address this issue. The Student Senate calls for increased funding and support for disability services, mental health counseling, and accessibility accommodations in order to ensure a more inclusive and supportive campus environment for all students. The resolution also emphasizes the importance of raising awareness and reducing stigma surrounding disability and mental health.",
    "id": "SSB 2022-1042",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning the Presidential Search Committee and Student Body President Lauren Lemasters for Nominating Ben Sasse as the Finalist in UF’s Presidential Search",
    "sponsor": "Majority Party Leader Blake Cox, Senator Kathryn Holmes, Senator Danny Wolcott, Senator Joaquin Rafaele Marcelino, Senator Pari Patel, Senator Savanah Partridge, Senator Miranda Holder, Senator John Rassel, Senator Jorge Perez, Senator Grace Shoemaker, Senator Cassie Urbenz, Senator Danny Kopelman, Senator Bianca Barri",
    "author": "Minority Party Leader Faith Corbett, Deputy Minority Party Leader Gabriela Montes, Senator Connor Panish, Senator Jonathan C. Stephens",
    "summary": "Resolution Condemning the Presidential Search Committee and Student Body President Lauren Lemasters for Nominating Ben Sasse as the Finalist in UF’s Presidential Search",
    "id": "SSB 2022-1043",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Acknowledging the Impact of Hurricane Ian in Southwest Florida",
    "sponsor": "Minority Party Leader Faith Corbett, Deputy Minority Leader Gabriela Montes, Senator Anjali Natarajan, Senator Cassie Urbenz, Senator Nathan McGinnis, Senator Danny Wolcott, Senator Navya Nair, Senator Joaquin Marcelino, Senator Jonathan Stephens, Senator Evan Asuncion, Senator Pari Patel, Senator Savanah Partridge, Senator Jorge R. Perez, Senator Naeliz Lopez, Senator Connor Panish, Senator Lilliana Clark, Senator Sean Harkins, Senator John Rassel, Senator Julia Seif",
    "author": "",
    "summary": "Resolution Acknowledging the Impact of Hurricane Ian in Southwest Florida",
    "id": "SSB 2022-1044",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Student Senate Discovery Period Assurance Initiative (SSDPAI)",
    "sponsor": "Minority Party Leader Faith Corbett, Deputy Minority Party Leader Gabriela Montes, Senator Cassandra Urbenz, Senator Nathan McGinnis, Senator John Rassel, Senator Joaquin Rafaele Marcelino, Senator Hana Ali, Senator Savanah Partridge, Senator Connor Panish, Senator Mohammed Faisal",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Student Senate Discovery Period Assurance Initiative (SSDPAI) is a bill proposed by Senator Jonathan C. Stephens. It aims to provide assurance and support for the discovery period of the Student Senate. The initiative is sponsored by Minority Party Leader Faith Corbett, Deputy Minority Party Leader Gabriela Montes, Senator Cassandra Urbenz, Senator Nathan McGinnis, Senator John Rassel, Senator Joaquin Rafaele Marcelino, Senator Hana Ali, Senator Savanah Partridge, Senator Connor Panish, and Senator Mohammed Faisal.",
    "id": "SSB 2022-1045",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Senate Post-Recess Attendance Initiative (SPRAI)",
    "sponsor": "Minority Party Leader Faith Corbett, Senator Nathan McGinnis, Senator Joaquin Rafaele Marcellino, Senator Savanah Partridge, Senator Mohammed Faisal",
    "author": "Senator Jonathan C. Stephens",
    "summary": "This bill, titled Senate Post-Recess Attendance Initiative (SPRAI), is authored by Senator Jonathan C. Stephens with sponsorship from Minority Party Leader Faith Corbett, Senator Nathan McGinnis, Senator Joaquin Rafaele Marcellino, Senator Savanah Partridge, and Senator Mohammed Faisal. The bill proposes amendments to Rule IV of the University of Florida Student Senate's attendance policy. These amendments aim to address post-recess attendance and roll call procedures. The bill outlines the responsibilities of the Chair of the Rules and Ethics Committee (or Vice-Chair in the Chair's absence) in conducting roll calls and designates the Senate President to call the roll if no members of the Rules and Ethics Committee are present. This initiative seeks to improve attendance tracking and promote transparency in the Senate's operations.",
    "id": "SSB 2022-1046",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning “The Johns Committee”",
    "sponsor": "Minority Party Leader Faith Corbett, Deputy Minority Party Leader Gabriela Montes, Senator Navya Nair, Senator Connor Panish, Senator Joaquin Rafaele Cecilia Marcelino, Senator Evan Asuncion, Senator Wavid Bowman, Senator Hana Ali, Senator Grace Shoemaker, Senator Mohammed Faisal, Senator John Rassel",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Florida Legislative Investigation Committee (FLIC, better known as the “Johns Committee”, under the direction of former senator Charley E. Johns, was created in 1956. This resolution condemns the actions and practices of the Johns Committee, which engaged in McCarthyite tactics and violated the civil rights of individuals under the pretense of investigating communist activities. The Student Senate expresses its commitment to upholding the principles of equality, justice, and freedom, and stands against any form of discrimination or repression.",
    "id": "SSB 2022-1047",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Encouraging University of Florida Students to Vote in the 2022 Midterm Elections",
    "sponsor": "Minority Party Leader Faith Corbett, Senator Jonathan C. Stephens, Senator Cassandra Urbenz, Senator Anjali Natarajan, Senator Luke Asuncion, Senator Oscar Santiago Perez, Senator John Rassel, Senator Danny Wolcott, Senator Mohammed Faisal, Senator Mason Solomon",
    "author": "Senator Evan Asuncion, Senator Connor Panish, Senator Navya Nair",
    "summary": "The University of Florida Student Senate encourages students to vote in the 2022 United States Midterm Elections. These elections provide an opportunity for registered Florida voters to cast their votes for various government positions, including a Florida U.S. Senator and the Governor. Voting is a fundamental right that allows individuals to contribute to the democratic process and have a say in shaping the future of their communities. By exercising their right to vote, University of Florida students can actively participate in decision-making processes and voice their opinions on important issues. The Student Senate recognizes the importance of civic engagement and encourages student involvement in the upcoming elections.",
    "id": "SSB 2022-1048",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution in Solidarity With the Women of Iran",
    "sponsor": "Deputy Minority Leader Gabriela Montes, Senator Jonathan C. Stephens, Senator Ibrahim Siddiqui, Senator Nathan McGinnis, Senator Katie Holmes, Senator Anjali Natarajan, Senator Navya Nair, Senator Joaquin Rafaele Cecilia Marcelino, Senator Evan Asuncion, Senator John Rassel",
    "author": "Senator Danny Wolcott",
    "summary": "Mahsa Amini was killed by the Iranian Morality Police for not properly adhering to Iran’s dress regulations in September of 2022. The women of Iran have been bravely protesting daily for their rights and freedoms since September 17th, 2022.",
    "id": "SSB 2022-1049",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Senate Town Hall Explanation, Verification, and Implementation Act (STHEVIA)",
    "sponsor": "Minority Party Leader Faith Corbett, Senator Oscar Santiago Perez, Senator Grace Shoemaker, Senator Mohammed Faisal, Senator John Rassel, Senator Wavid Bowman, Judiciary Chairman Sean Harkins, Rules and Ethics Chairwoman Lilliana Clark, Senator Mason Solomon, Senator Aaron Amster, Senator Bianca Barrios, Senator Wilson Roberts, Senator Haley Rubin, Senator Saketh Damera, Senator Brendan Kligerman",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Senate Town Hall Explanation, Verification, and Implementation Act (STHEVIA) proposes the CHAPTER 324 STUDENT SENATOR ACCOUNTABILITY ACT, sponsored by Senator Jonathan C. Stephens and supported by various senators. This act aims to enhance accountability for student senators by providing a mechanism for explanation, verification, and implementation of their actions. It ensures that student senators uphold their responsibilities and serve the student body effectively. Through this act, the Student Senate aims to maintain transparency and integrity in its actions and decisions.",
    "id": "SSB 2022-1050",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Statute Technical Expansion and Clarity Act - Volume | (STECA v1)",
    "sponsor": "Senator Mohammed Faisal, Senator John Rassel",
    "author": "Senator Jonathan C. Stephens",
    "summary": "This bill, titled the Statute Technical Expansion and Clarity Act - Volume | (STECA v1), aims to provide technical expansion and clarity to the existing statutes of the Student Body. It proposes amendments to Chapter 100 of the Student Body Statutes, which covers the system of the Student Body. The bill organizes the statutes into titles and chapters based on subject matter and ensures a coherent and comprehensible structure. The primary objective of the bill is to enhance the accessibility and usability of the Student Body Statutes.",
    "id": "SSB 2022-1051",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Statute Technical Expansion and Clarity Act — Volume 2 (STECA v2)",
    "sponsor": "Senator Mohammed Faisal, Senator John Rassel",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Statute Technical Expansion and Clarity Act — Volume 2 (STECA v2) is a bill authored by Senator Jonathan C. Stephens. It aims to expand and clarify certain statutes in order to improve transparency. The bill proposes amendments to Chapter 131 of THE POLITICAL CORRESPONDENCE TRANSPARENCY ACT, which deals with political correspondence. It defines terms such as 'political correspondence' and 'relative' and establishes guidelines for communication between public officials and candidates for public office. The bill is sponsored by Senator Mohammed Faisal and Senator John Rassel.",
    "id": "SSB 2022-1052",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Statute Technical Expansion and Clarity Act — Volume 3 (STECA v3)",
    "sponsor": "Senator Mohammed Faisal, Senator John Rassel",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Statute Technical Expansion and Clarity Act (STECA v3) is a bill authored by Senator Jonathan C. Stephens and sponsored by Senator Mohammed Faisal and Senator John Rassel. The bill aims to provide technical expansion and clarity to existing statutes. It specifically focuses on Chapter 236, the Complimentary Ticket Act, which regulates the distribution of complimentary tickets for events organized by ACCENT and Student Government Productions. The bill requires the responsible officers of these organizations to submit accurate and complete lists of individuals receiving complimentary tickets for events under their control. This will ensure transparency and accountability in the ticket distribution process.",
    "id": "SSB 2022-1053",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Statute Technical Expansion and Clarity Act — Volume 4 (STECA v4)",
    "sponsor": "Senator Mohammed Faisal, Senator John Rassel",
    "author": "Senator Jonathan C. Stephens",
    "summary": "This bill, titled Statute Technical Expansion and Clarity Act — Volume 4 (STECA v4), is authored by Senator Jonathan C. Stephens and sponsored by Senator Mohammed Faisal and Senator John Rassel. The bill proposes amendments and clarifications to existing statutes, specifically Chapter 503, related to the selection and term of office of non-voting student delegates to the Faculty Senate. The bill aims to improve technical aspects of the statutes and ensure clarity in the selection process and term duration of the student delegates.",
    "id": "SSB 2022-1054",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Statute Technical Expansion and Clarity Act - Volume 5 (STECA v5)",
    "sponsor": "Senator Mohammed Faisal, Senator John Rassel",
    "author": "Senator Jonathan C. Stephens",
    "summary": "Statute Technical Expansion and Clarity Act - Volume 5 (STECA v5) is a bill introduced by Senator Jonathan C. Stephens. The bill aims to provide technical expansion and clarity to existing statutes. It has been sponsored by Senator Mohammed Faisal and Senator John Rassel. The bill seeks to improve transparency and efficiency in the legislative process. It will be enacted if not vetoed within 10 days.",
    "id": "SSB 2022-1055",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning the Rise in Antisemitism",
    "sponsor": "Senate President Olivia Green, Majority Party Leader Cox, Senator Aaron Amster, Senator Ethan Ghozali, Senate President Pro-Tempore Catherine Giordano, Senator Santiago Alvarez, Senator Nyla Pierre, Member at-Large Ana Carolina Troncoso, Senator Joah Levine, Senator Danny Kopelman, Senator Jake Weiner, Senator Clayton Bush, Senator Julia Seifer, Member at-Large Mara Vaknin, Senator Brett Barnett, Senator Shelby Schultz, Senator Presley Baesler, Senator Mason Solomon, Senator Samuel Rosenkranz",
    "author": "Judiciary Chairman Sean Harkins, Senator Brendan Kligerman, Senator Haley Rubin",
    "summary": "Resolution Condemning the Rise in Antisemitism authored by Judiciary Chairman Sean Harkins, Senator Brendan Kligerman, Senator Haley Rubin and sponsored by Senate President Olivia Green, Majority Party Leader Cox, Senator Aaron Amster, Senator Ethan Ghozali, Senate President Pro-Tempore Catherine Giordano, Senator Santiago Alvarez, Senator Nyla Pierre, Member at-Large Ana Carolina Troncoso, Senator Joah Levine, Senator Danny Kopelman, Senator Jake Weiner, Senator Clayton Bush, Senator Julia Seifer, Member at-Large Mara Vaknin, Senator Brett Barnett, Senator Shelby Schultz, Senator Presley Baesler, Senator Mason Solomon, Senator Samuel Rosenkranz. The resolution condemns the rise in antisemitism.",
    "id": "SSB 2022-1057",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Gender Neutral Wording Act Vol. 2 - 300 Codes Revision",
    "sponsor": "Senator Nathan McGinnis, Senator Wavid Bowman, Senator John Rassel, Senator Cable, Senator Levine, Judiciary Chairman Sean Harkins, Senator Mason Solomon, Senator Haley Rubin, Senator Liam Antoswezki, Senator Wilson Roberts, Senator Hana Ali, Senator Joaquin Rafaele Cecilia Marcelino, Senator Navya Nair",
    "author": "LGBTQ+ Caucus Chair Oscar Santiago Perez",
    "summary": "CHAPTER 324 STUDENT SENATOR ACCOUNTABILITY ACT (79-221, 81-155, 82-105, 82-139, 82-164, 82-165, 83-102, 83-200, 84-139, 87-163, 88-117, 88-134, 89-117, 89-118, 89-130, 90-126, 91-118, 92-101, 92-143, 94-114, 95-102, 95-102, 96-116, 98-104, 98-120, 99-122, 2000-146, 2000-154, 2002-143, 2002-158, 2003-122, 2004-122, 2005-118, 2005-140",
    "id": "SSB 2022-1058",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Commemorating November as American Native Heritage Month",
    "sponsor": "Senator Jonathan Chance Stephens, Senator Nyla Pierre, Senator Mimi Abrucia, Senator Nathan McGinnis, Senator Anjali Natarajan, Senator Joaquin Rafaele Cecilia Marcelino, Senator Julia Seifer, Senator John Rassel, Senator Hana Ali, Senator Ashley Shakib, Deputy Minority Party Leader Gabriela Montes, Senator Oscar Santiago Perez, Minority Party Leader Faith Corbett, Senator Miranda Holder, Senator Connor Panish",
    "author": "Senator Cassie Urbenz",
    "summary": "On August 3, 1990, President of the United States George H. W. Bush declared the month of November as National American Indian Heritage Month, also known as American Native Heritage Month. The University of Florida Student Senate recognizes and commemorates this important celebration of the rich cultural heritage, traditions, contributions, and history of Native Americans. Through this resolution, the Senate acknowledges the significant impact of Native American individuals, tribes, and communities in shaping the United States. The Senate encourages the University of Florida community to engage in educational and cultural activities that promote understanding, respect, and appreciation for Native American heritage throughout the month of November. Furthermore, the Senate urges all members of the university to participate in events, programs, and initiatives that promote dialogue, awareness, and celebration of Native American cultures.",
    "id": "SSB 2022-1059",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Recognizing October as LGBTQIA+ History Month",
    "sponsor": "Senator Jonathan C. Stephens, Deputy Minority Party Leader Gabriela Montes, Senator Nathan McGinnis, Senator Hana Ali, Senator Wavid Bowman, Senator John Rassel, Senator Cassie Urbenz, LGBTQ+ Caucus Chair Oscar Santiago Perez",
    "author": "Senator Joaquin Rafaele Cecilia Marcelino",
    "summary": "The University of Florida Student Senate recognizes October as LGBTQIA+ History Month. This resolution acknowledges the active efforts made by the Senate to support and acknowledge the LGBTQIA+ community at the University of Florida. It also highlights the history of restrictions on LGBTQ+ rights and freedoms at the national and state level, emphasizing the need for continued advocacy and support for LGBTQ+ individuals. The resolution is sponsored by Senator Jonathan C. Stephens, Deputy Minority Party Leader Gabriela Montes, Senator Nathan McGinnis, Senator Hana Ali, Senator Wavid Bowman, Senator John Rassel, Senator Cassie Urbenz, and LGBTQ+ Caucus Chair Oscar Santiago Perez.",
    "id": "SSB 2022-1060",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Recognizing the First Generation Week and the Creation of the First Generation Living Learning Community",
    "sponsor": "Student Body Vice President Daniel Badell, Senate President Pro-Tempore Catherine Giordano, Judiciary Chairman Sean Harkins, Budget & Appropriations Chairwoman Emily Pecora, Rules & Ethics Chairwoman Lilliana Clark, Information & Communications Chairwoman Phoebe Funai, Member-at-Large Mara Vaknin, Member-at-Large Ana Carolina Troncoso, Senator Jacob Kanfer, Senator Julia Seifer, Senator Brendan Kligerman, Senator Clayton Bush, Senator Garrett Josephson, Senator Bianca Barrio",
    "author": "Senate President Olivia Green",
    "summary": "Resolution recognizing the First Generation Week and the creation of the First Generation Living Learning Community.",
    "id": "SSB 2022-1061",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Supporting the Food Insecurity Task Force Collaboration with the Alan & Cathy Hitchcock Field & Fork Pantry",
    "sponsor": "Student Body Vice President Daniel Badell, Senate President Pro-Tempore Catherine Giordano, Judiciary Chairman Sean Harkins, Budget & Appropriations Chairwoman Emily Pecora, Rules & Ethics Chairwoman Lilliana Clark, Information & Communications Chairwoman Phoebe Funai, Member-at-Large Mara Vaknin, Member-at-Large Ana Carolina Troncoso, Senator Jacob Kanfer, Senator Julia Seifer, Senator Brendan Kligerman, Senator Clayton Bush, Senator Garrett Josephson, Senator Bianca Bar",
    "author": "Senate President Olivia Green",
    "summary": "Resolution Supporting the Food Insecurity Task Force Collaboration with the Alan & Cathy Hitchcock Field & Fork Pantry",
    "id": "SSB 2022-1062",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for Expanded Hybrid Parking Decals to Address Growing Concerns for Student Parking on the University of Florida Campus",
    "sponsor": "Minority Party Leader Faith Corbett, Deputy Minority Party Leader Gabriela Montes, Senator Anjali Natarajan, Senator Evan E. Rafanan, Senator Anaum Virani, Senator Hana Ali, Senator Oscar Santiago Perez, Senator Nathan McGinnis, Senator Navya Nair, Senator Connor Panish, Senator Gabriel Velasquez-Neira",
    "author": "Senator Cassie Urbenz, Senator John Rassel, Senator Joaquin Rafaele Cecilia Marcelino, Senator Jonathan Chance Stephens",
    "summary": "UF Student Senate Bill 2022-1063 advocates for expanded hybrid parking decals on the University of Florida campus in response to growing concerns about student parking. The resolution is authored by Senator Cassie Urbenz, Senator John Rassel, Senator Joaquin Rafaele Cecilia Marcelino, and Senator Jonathan Chance Stephens. The bill is sponsored by Minority Party Leader Faith Corbett, Deputy Minority Party Leader Gabriela Montes, Senator Anjali Natarajan, Senator Evan E. Rafanan, Senator Anaum Virani, Senator Hana Ali, Senator Oscar Santiago Perez, Senator Nathan McGinnis, Senator Navya Nair, Senator Connor Panish, and Senator Gabriel Velasquez-Neira. The resolution aims to address the parking issues by advocating for the expansion of hybrid parking decals for students. The specific details and impact of the proposed expansion are not provided in the summary.",
    "id": "SSB 2022-1063",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for Expanded Access to Gender Affirming Care in the State of Florida",
    "sponsor": "Minority Party Leader Faith Corbett, Senator Connor Panish",
    "author": "Senator Joaquin Rafaele Cecilia Marcelino, Senator Oscar Santiago Perez, Senator Cassie Urbenz, Senator Anaum Virani, Senator Jonathan C. Stephens",
    "summary": "The Student Senate advocates for expanded access to gender-affirming care in the state of Florida. Gender-affirming care includes social, psychological, behavioral, and medical interventions that support and affirm an individual's gender identity. Research shows that gender-affirming care improves the mental health and well-being of transgender individuals. The resolution calls for policies and legislation that promote affordable and accessible gender-affirming care for all residents of Florida. It also recognizes the importance of healthcare providers receiving proper training on transgender healthcare. The Student Senate urges lawmakers and healthcare organizations to take action to ensure that everyone has access to the care they need to affirm their gender identity.",
    "id": "SSB 2022-1064",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Online Voting Constitutional Amendment",
    "sponsor": "Minority Party Leader Faith Corbett, Senator Cassie Urbenz, Deputy Minority Party Leader Gabriela Montes, Senator Luke Asuncion, Senator Evan E. Rafanan, Senator Joaquin Rafaele Cecilia Marcelino, Senator Connor Panish",
    "author": "Senator Oscar Santiago Perez, Senator Jonathan C. Stephens",
    "summary": "The Student Senate proposes a constitutional amendment to Article VI of the Student Body Constitution for the implementation of verified and secured real-time online remote voting on election day. This amendment aims to enhance accessibility and convenience for student voters in the University of Florida Student Body elections.",
    "id": "SSB 2022-1065",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Memorializing the Lives Lost at Club Q in Colorado Springs, Colorado",
    "sponsor": "Minority Party Leader Faith Corbett, Senator Evan E. Rafanan, Senator Luke Asuncion, Senator Joaquin Rafaele Cecilia Marcelino, Senator Connor Panish",
    "author": "Deputy Minority Party Leader Gabriela Montes, Senator Navya Nair, Senator Jonathan C. Stephens",
    "summary": "On November 19th, 2022, at least 5 people were killed by a lone gunman in a Colorado LGBTQ+ nightclub, Club Q. The victims include Daniel Aston, Raymond Green Vance, Kelly Loving, Ashley Paugh, and Derrick Rump.",
    "id": "SSB 2022-1066",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Addressing Professional Resources and Critical Needs for Arts Students at the: University of Florida",
    "sponsor": "Minority Party Leader Faith Corbett, Deputy Minority Party Leader Gabriela Montes, Senator Connor Panish, Senator Hana Ali, Senator Miranda Holder, Senator Navya Nair",
    "author": "Senator Cassie Urbenz, Senator Evan E. Rafanan",
    "summary": "The University of Florida Student Senate resolves to address the professional resources and critical needs of arts students at the University of Florida. The College of the Arts offers resources for education, portfolio building, leadership development, and collaborative strategies. The Student Senate recognizes the importance of supporting these resources to enhance the professional growth and development of arts students. It expresses its commitment to working with the College of the Arts and relevant stakeholders to identify and meet the critical needs of arts students, and ensure their success and well-being at the University of Florida.",
    "id": "SSB 2022-1067",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Celebrating the Presidential Tenure of University of Florida President W. Kent Fuchs",
    "sponsor": "Senate President Olivia Green, Senate President Pro-Tempore Catherine Giordano, Budget and Appropriations Chairwoman Emily Pecora, Information and Communications Chairwoman Phoebe Funai, Majority Party Leader Blake Cox, Rules and Ethics Chairwoman Lilliana Clark, Senator John Brinkman, Senator Ethan Ghozali, Senator Brendan Kligerman, Member At-Large Mara Vaknin, Senator Shelby Schultz, Senator Haley Rubin, Senator Liam Antoszewski, Senator Santiago Alvarez",
    "author": "Student Body President Lauren Lemasters, Judiciary Chairman Sean Harkins",
    "summary": "Resolution Celebrating the Presidential Tenure of University of Florida President W. Kent Fuchs",
    "id": "SSB 2022-1068",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Recognizing the “Red Zone” and Supporting Sexual Assault Awareness & Prevention Initiatives",
    "sponsor": "Senator Sidney Ruedas, Senator Bianca Barrios, Majority Party Leader Blake Cox, Nightlife NaviGators Agency Head Hagen Turner, Senator John Brinkman, Senator Justin Lanzuela, Senator Phoebe Funai, Senator Gretchen Howard, Senator Samuel Rosenkranz, Senator Kaitlyn Berger, Senator Mason Solomon, Senator Madi Koukos, Senator Garrett Josephson, Senator Julia Seifer, Senator Shelby Schultz, Senator Matt Reich, Senator Joah Levine, Senator Aaron Amster, Senator Jacey Cable, Senator Isabel Ponce, Senator Lily Clark",
    "author": "Senator Clayton Bush",
    "summary": "Resolution Recognizing the “Red Zone” and Supporting Sexual Assault Awareness & Prevention Initiatives",
    "id": "SSB 2022-1069",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Gender Neutral Wording Amendment to the Student Body Constitution",
    "sponsor": "Senator Jonathan C. Stephens, Senator John Rassel, Senator Cassie Urbenz, Deputy Minority Party Leader Gabriela Montes, Senator Connor Panish",
    "author": "LGBTQ+ Caucus Chair Oscar Santiago Perez",
    "summary": "This bill proposes a gender neutral wording amendment to the Student Body Constitution. The amendment aims to remove gender-specific language such as 'he/her' and 'his/hers' and replace it with gender neutral terms. The bill highlights the importance of inclusivity and equality in the student body constitution. It is sponsored by multiple senators, including LGBTQ+ Caucus Chair Oscar Santiago Perez, Senator Jonathan C. Stephens, Senator John Rassel, Senator Cassie Urbenz, Deputy Minority Party Leader Gabriela Montes, and Senator Connor Panish.",
    "id": "SSB 2023-1001",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution to Recognize and Promote the Spread Cream Cheese Not Hate Campaign",
    "sponsor": "Senate President Olivia Green, Senate President Pro-Tempore Catherine Giordano, Rules and Ethics Chairwoman Liliana Clark, Majority Party Leader Blake Cox, Judiciary Vice Chairwoman Sidney Ruedas, Senator Shelby Schultz, Senator Matthew Reich, Senator Clayton Bush, Senator Ethan Ghozali, Senator Joah Levine, Senator Mara Vaknin, Senator John Brinkman, Senator Brendan Kligerman, Senator Aaron Amster, Senator Danny Kopelman, Senator Saketh Damera, Senator Wilson Robert",
    "author": "Judiciary Chairman Sean Harkins, Senator Haley Rubin, Senator Mason Solomon",
    "summary": "Resolution to Recognize and Promote the Spread Cream Cheese Not Hate Campaign",
    "id": "SSB 2023-1003",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for the Addition of Discriminatory Acts as an Official Violation to the Orange Book Conduct Code Sections",
    "sponsor": "Senator Cassie Urbenz, Senator Hana Ali, Senator Miranda Holder, Senator Navya Nair, Senator John Rassel, Senator Connor Panish",
    "author": "Minority Party Leader Faith Corbett, Deputy Minority Party Leader Gabriela Montes, Senator Jonathan C. Stephens",
    "summary": "Resolution Advocating for the Addition of Discriminatory Acts as an Official Violation to the Orange Book Conduct Code Sections. The Student Senate acknowledges Regulation 4.040, also known as the “Student Honor Code and Student Conduct Code” or “The Orange Book,” which aims to establish a higher standard of conduct for the student body. The Senate recognizes the need to address various facets of respect and urges the addition of discriminatory acts as an official violation to the Orange Book Conduct Code Sections. This resolution will contribute to fostering an inclusive and respectful campus environment.",
    "id": "SSB 2023-1007",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Town Hall Productivity Act – 300 CODES REVISIONS",
    "sponsor": "Senator Bianca Barrios, Senator Aaron Amster, Senator Gretchen Howard, Senator Justin Lanzuela",
    "author": "Rules & Ethics Chairwoman Lilliana Clark, Senator Saketh Damera, Senator Mason Solomon",
    "summary": "STUDENT SENATE BILL 2023-1009: Town Hall Productivity Act – 300 CODES REVISIONS. The bill, authored by Rules & Ethics Chairwoman Lilliana Clark, Senator Saketh Damera, and Senator Mason Solomon, aims to revise Chapter 324 of the Student Senator Accountability Act. The sponsors of the bill are Senator Bianca Barrios, Senator Aaron Amster, Senator Gretchen Howard, and Senator Justin Lanzuela. The bill proposes several revisions to the codes, with the goal of improving productivity in town hall meetings. The bill seeks to enhance accountability and efficiency in the Student Senate.",
    "id": "SSB 2023-1009",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for Protections Against the Political Encroachment on the Florida Education System",
    "sponsor": "Senator Cassie Urbenz, Senator Danny Wolcott, Senator John Rassel, Senator Joaquin Rafaele C. Marcelino, Senator Miranda Holder, Senator Evan E. Rafanan",
    "author": "Senator Navya Nair, Deputy Minority Party Leader Gabriela Montes, Senator Nathan McGinnis, Senator Connor Panish, Senator Oscar Santiago Perez, Senator Grace Shoemaker, Senator Jonathan C. Stephens, Senator Anaum Virani",
    "summary": "The resolution advocates for protections against the political encroachment on the Florida Education System as introduced by Senator Navya Nair, Deputy Minority Party Leader Gabriela Montes, Senator Nathan McGinnis, Senator Connor Panish, Senator Oscar Santiago Perez, Senator Grace Shoemaker, Senator Jonathan C. Stephens, and Senator Anaum Virani. The resolution is sponsored by Senator Cassie Urbenz, Senator Danny Wolcott, Senator John Rassel, Senator Joaquin Rafaele C. Marcelino, Senator Miranda Holder, and Senator Evan E. Rafanan.",
    "id": "SSB 2023-1016",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning the Antisemitic Acts of February Ist and 2nd of 2023",
    "sponsor": "Senator Miranda Holder, Senator Evan E. Rafanan, Senator Connor Panish, Senator Navya Nair, Senator Jonathan C. Stephens, Senator Alexander Valentin, Senator Nathan McGinnis, Majority Party Leader Blake Cox, Judiciary Chairman Sean Harkins, Senate President Pro-Tempore Catherine Giordano, Information and Communications Chairwoman Phoebe Funai, Member-at-Large Mara Vaknin, Member-at-Large Ana Troncoso, Senator Nyla",
    "author": "Senator Cassie Urbenz, Deputy Minority Party Leader Gabriela Montes, Minority Party Leader Faith Corbett, Senator Oscar Santiago Perez",
    "summary": "Resolution Condemning the Antisemitic Acts of February Ist and 2nd of 2023",
    "id": "SSB 2023-1019",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning Recent Mass Shootings and Acts of Hate Towards Individuals of the Asian Community",
    "sponsor": "Senate President Olivia Green, Senator Nyla Pierre, Senate President Pro-Tempore Catherine Giordano, Budget and Appropriations Chairwoman Emily Pecora, Information and Communications Chairwoman Phoebe Funai, Rules and Ethics Chairwoman Lily Clark, Member at-Large Mara Vaknin, Senator Jacey Cable, Senator Charlize Ramos, Senator Joah Levine, Senator John Brinkman, Senator Mason Solomon, Senator Abigail Whittaker, Senator Samantha Kinggard, Sena",
    "author": "Senator Johnny Liu, Senator Saketh Damera, Judiciary Chairman Sean Harkins",
    "summary": "Resolution Condemning Recent Mass Shootings and Acts of Hate Towards Individuals of the Asian Community.",
    "id": "SSB 2023-1023",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution addressing the February 13, 2023 shooting at Michigan State University",
    "sponsor": "Judiciary Chairman Sean Harkins, Majority Party Leader Blake Cox, Senator Santiago Alvarez, Senator Johnny Liu, Senator Viridiana Lopez-Lugo, Member-at-Large Ana Troncoso, Senator Jacob Kanfer, Senator Matt Reich, Rules and Ethics Chairwoman Lily Clark, Senator Brendan Kligerman, Senator Sam Kinggard, Senator John Brinkman, Member-at-Large Mara Vaknin, Senator Joah Levine, Senator Sam Platovsky, Senator Christine Locascio, Senator Sidney Ruedas, Senator Clayton Bush, Senate President Olivia Green, Senator Julia Seifer, Senator Brett Barnett, Senator Aaron Amster, Senator Bian",
    "author": "Senator Samuel Rosenkranz, Senator Elijah Chudnow, Senator Andrei Berekhovski",
    "summary": "This resolution addresses the February 13, 2023 shooting at Michigan State University.",
    "id": "SSB 2023-1024",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Calling for the Immediate Reversal of the Plans to Close and Demolish Maguire Village and University Village South (UVS) Graduate and Family Housing Facilities",
    "sponsor": "Senator Jagannath Jayanti, Senator Cassie Urbenz, Senator Navya Nair, Senator Connor Panish, Senator Grace Shoemaker, Senator John Rassel, Minority Party Leader Gabriela Montes, Deputy Minority Party Leader Santiago Perez, Senator Marcelino",
    "author": "Senator Hana Ali",
    "summary": "UF Student Senate Bill 2023-1027 calls for the immediate reversal of the plans to close and demolish Maguire Village and University Village South (UVS) Graduate and Family Housing Facilities. The resolution highlights the recent earthquake in southern Turkey and northern Syria, which resulted in significant casualties. The resolution further emphasizes the importance of these housing facilities in providing necessary housing for graduate students and families. The resolution is supported by multiple sponsors and seeks to protect the well-being and housing needs of the UF community.",
    "id": "SSB 2023-1027",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Calling for the Immediate Reversal of the Plans to Close and Demolish Maguire Village and University Village South (UVS) Graduate and Family Housing Facilities",
    "sponsor": "Minority Party Leader Gabriela Montes, Senator Grace Shoemaker, Senator Cole Hautamaki",
    "author": "Senator Jonathan C. Stephens",
    "summary": "On March of 2021, the University of Florida Board of Trustees approved the Campus Development Agreement that included the demolition of Maguire Village and University Village South [1]. Maguire Village and University Village South, better known as UVS, are two of the five dedicated graduate housing facilitates under the terminology 'Villages'. The University of Florida Student Senate passed unanimously Resolution 2021-1029, calling for an immediate reversal of the plans to close and demolish these housing facilities.",
    "id": "SSB 2023-1029",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "STUDENT GOVERNMENT FOOD EXPENDITURES EXPANSION DENOTION (SG FEED) ACT",
    "sponsor": "Senator Mohammed Faisal, Senator John Rassel, Senator Joaquin Rafaele C. Marcelino, Senator Miranda",
    "author": "Senator Jonathan C. Stephens, Senator Connor Panish",
    "summary": "CHAPTER 808 ADMINISTRATIVE REGULATIONS - EXTERNAL CONTROL (71-120, 73-139, 80-223, 82-145, 87-152, 88-106, 88-125, 90-141, 92-123, 93-123, 95-110, 96-114, 97-103, 97-131, 97- 139, 98-128, 2002-140, 2004-119, 2004-107, 2005-101, 2005-106, 2005-122, 2005-142, 2006-106, 2006-107, 2006-122, 2007-113, 2008-150, Ballot Initiative 2009, 2009-113, 2009-128, 2010-119, 2011- 118, 2012-108, 2014-115, 2015-115, 2016-120, 2017-109, 2018-111, 2018-114, 2018-115, 2019-102, 2020-1052) 808.8 Funding Limits: 1. Student Government",
    "id": "SSB 2023-1030",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "BUDGET ONLINE RESOURCES ACCESSIBILITY ACT (BORAA)",
    "sponsor": "Senator Joaquin Rafaele C. Marcelino",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Budget Online Resources Accessibility Act (BORAA) aims to ensure that Student Government budgets, including the Activity and Service Fee Budget, Student Government-Funded Organizational Budget, and Academic Organizations Budget, are accessible online. These budgets will be posted for the current fiscal year and the following fiscal year, providing transparency and accountability. The Student Body Treasurer will be responsible for the implementation of this act.",
    "id": "SSB 2023-1031",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "TITLE VII - STUDENT BODY STATUTES",
    "sponsor": "",
    "author": "Jonathan C. Stephens",
    "summary": "This bill, authored by Jonathan C. Stephens, proposes the establishment of Title VII in the Student Body Statutes, which includes several chapters that address student government, code of ethics, government transparency, public record laws, student body awareness, FCC compliance, exclusionary offices, and political correspondence transparency.",
    "id": "SSB 2023-1033",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Student Government Statute Cover Page Accessibility Initiative (SGSAI)",
    "sponsor": "",
    "author": "Senator Jonathan C. Stephens",
    "summary": "Student Senate Bill 2023-1034 proposes the implementation of the Student Government Statute Cover Page Accessibility Initiative (SGSAI). The bill aims to compile all Student Body Laws of permanent effect and general public interest, or of legal or historical significance, into a codification known as Student Body Statutes. This compilation will include the constitution in its entirety and all by-laws of the Student Senate. The purpose of the initiative is to ensure accessibility and ease of reference for the student body.",
    "id": "SSB 2023-1034",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Statute Technical Expansion and Clarity Act — Volume 6 (STECAv6)",
    "sponsor": "",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Statute Technical Expansion and Clarity Act — Volume 6 (STECAv6) is a bill authored by Senator Jonathan C. Stephens. This bill aims to provide technical expansion and clarity to existing statutes. It seeks to enhance the understanding and interpretation of the law by making amendments and revisions. The STECAv6 will be enacted if not vetoed within 10 days of its proposal.",
    "id": "SSB 2023-1035",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Statute Technical Expansion and Clarity Act —- Volume 7",
    "sponsor": "",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Student Government State of the Campus Address will serve to strengthen communication amongst the various branches, agencies, and committees of Student Government; provide information concerning the status of all projects and issues concerning Student Government in relation to the wellbeing of the Student Body; and to foster an efficient mechanism for addressing the agenda from Student Gover",
    "id": "SSB 2023-1036",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Statute Technical Expansion and Clarity Act - Volume 8 (STECAv8)",
    "sponsor": "",
    "author": "Senator Jonathan C. Stephens",
    "summary": "This bill, titled the Statute Technical Expansion and Clarity Act - Volume 8 (STECAv8), aims to provide technical expansion and clarity to the existing statutes. The bill, authored by Senator Jonathan C. Stephens, proposes amendments to sections 210.2, 210.4, and 211.2. The objective of this bill is to enhance the understanding and applicability of the statutes.",
    "id": "SSB 2023-1037",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Statute Technical Expansion and Clarity Act —- Volume 9 (STECAv9)",
    "sponsor": "",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Executive Branch Officials are responsible to the Student Body President, Student Body Vice President, and Student Body Treasurer in whose name each Executive Branch Official acts. The Executive Secretaries shall serve as secretaries to the Student Body President on public policy decisions as well as the responsibilities established in Section 210.51, S.B.S. The Executive Agency Heads shall serve as the directors of said agencies and assist the Student Body",
    "id": "SSB 2023-1038",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Authorizing the Fall 2023 and Spring 2024 Election Dates",
    "sponsor": "Majority Party Leader Evan E. Rafanan, Senator John Lin, Senator Mohammed Faisal, Deputy Majority Party Leader Navya Nair, Senator Simone Liang, Senator Nathaniel Pelton, Senator Raj Mia, Senator Arunabho Basu, Senator Rachel Hartnett",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "Resolution Authorizing the Fall 2023 and Spring 2024 Election Dates. Sponsored by Majority Party Leader Evan E. Rafanan, Senator John Lin, Senator Mohammed Faisal, Deputy Majority Party Leader Navya Nair, Senator Simone Liang, Senator Nathaniel Pelton, Senator Raj Mia, Senator Arunabho Basu, Senator Rachel Hartnett",
    "id": "SSB 2023-1042",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Senate Resolution to Protect Bright Futures for All Majors",
    "sponsor": "Senate President Oscar Santiago Perez, Senate President Pro Tempore Nathan McGinnis, Majority Party Leader Evan Rafanan, Senator Timothy Sinclair, Senator Monish Vijayaraghavan, Senator Isabel Penin, Senator Miranda Holder, Senator Ana Alvarez, Senator Jagannath Jayanti, Senator Maximillian Banach, Senator Hana Ali, Senator Caitlyn Mathews, Senator Zoe Richter, Senator John Lin, Senator Asif Islam, Senator Connor Panish, Senator Mohammed Faisal, Senator Simone Liang, Senator Wavid Bowman, Senator Chalisa Budhai, Senator Raj Mia",
    "author": "Senator Nathaniel Pelton",
    "summary": "Senate Resolution to Protect Bright Futures for All Majors. The resolution is authored by Senator Nathaniel Pelton and sponsored by Senate President Oscar Santiago Perez, Senate President Pro Tempore Nathan McGinnis, Majority Party Leader Evan Rafanan, and several other senators. The resolution aims to ensure that Bright Futures scholarships are available to students across all majors. It highlights the importance of supporting students' academic pursuits and acknowledges the significant impact of Bright Futures on students' educational opportunities. The resolution emphasizes the value of a diverse range of majors and the positive contribution they make to society. The Student Senate intends to advocate for equal access to Bright Futures scholarships for all students, regardless of their chosen field of study.",
    "id": "SSB 2023-1043",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Commemorating the Life of Gabriel Jake Gutierrez",
    "sponsor": "Majority Party Leader Evan E. Rafanan, Senator Hana Ali, Senator Nathaniel\nPelton, Senator Ana Alvarez, Senator Simone Liang, Senator Anghelo Gangano, Senator\nAndrew Taramykin, Senator John Lin",
    "author": "Senator Cec Wood-Barron",
    "summary": "Gabriel Jake Gutierrez passed away this Spring semester. Gabriel was an avid student at the University of Florida, majoring in Analytical\nChemistry. Gabriel Jake Gutierrez was a member of the Baritone section of the Gator Band.",
    "id": "SSB 2023-1046",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for Activity and Service Fee Relief for Graduate Assistants",
    "sponsor": "Senator Anghelo Gangano, Senator Caitlyn Mathews, Senator Anna Huber, Senator Raj Mia, Senator Jorge Perez, Senator Simone Liang, Senator Nathaniel Pelton, Senator Colin Lasch, Senator John Lin",
    "author": "Senator Jonathan C. Stephens, Senator Connor Panish, Senator Rachel Hartnett",
    "summary": "Graduate Assistants, who are graduate students with part-time teaching or research duties, are facing rising costs of living. This resolution advocates for activity and service fee relief for Graduate Assistants to alleviate financial burden and support their academic pursuits. The University of Florida Student Senate recognizes the importance of providing affordable resources for Graduate Assistants and their contributions to the university. By implementing fee relief measures, the university can create a supportive environment that promotes the success and well-being of Graduate Assistants.",
    "id": "SSB 2023-1047",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "BUDGET AND APPROPRIATIONS CRITERIA OF REVIEW ACT (BACORA)",
    "sponsor": "",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Budget and Appropriations Committee will consist of the following members: Nine Senators named to the committee by the Senate, one of which will be the Committee Chair. A member of the Student Body that is appointed by the Budget and Appropriations Committee Chair as the Budget and Appropriations Committee Clerk, who serves as the taker of minutes, for the Budget and Appropriations Committee, as an ex-officio non-voting, nonspeaking member.",
    "id": "SSB 2023-1048",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Opposing the State Takeover of the Gainesville Regional Utilities Authority",
    "sponsor": "Senator Joaquin Rafaele C. Marcelino, Senator Nathaniel Pelton, Senator JohnLin, Senator Anghelo Gangano, Senator Raj Mia, Senator Jorge Perez, Senator Arunabho Basu",
    "author": "Senator Jonathan C. Stephens",
    "summary": "On April 10th, 2023, Florida State Representative Chuck Clemons filed Florida House Bill 1645 that would shift the authority of the Gainesville Regional Utilities (GRU) from the City of Gainesville Commission’s control to the Governor’s control. The Student Senate opposes this state takeover and supports maintaining the control of GRU under the City of Gainesville Commission.",
    "id": "SSB 2023-1049",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning Florida’s Six Week Abortion Ban and Reaffirming the University of Florida’s Commitment to Providing Reproductive and Sexual Health Resources",
    "sponsor": "Senate President Pro Tempore Nathan McGinnis, Majority Party Leader Evan E. Rafanan, Deputy Majority Party Leader Navya Nair, Senator Jordan LoSardo, Senator Andrew Taramykin, Senator Anna Huber, Senator Quoc Pham, Senator Nathaniel Pelton, Senator John Lin, Senator Joaquin Rafaele C. Marcelino, Senator Anghelo Gangano, Senator Anjali Natarajan, Senator Ana Alvarez, Senator Raj Mia, Senator Mohammed Faisal, Senator Jorge Perez",
    "author": "Senator Simone Liang",
    "summary": "Resolution Condemning Florida’s Six Week Abortion Ban and Reaffirming the University of Florida’s Commitment to Providing Reproductive and Sexual Health Resources.",
    "id": "SSB 2023-1050",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning the Passage of Florida Senate Bill 266 (2023) and the Previous Attempts of Florida House Bill 999 (2023) and their Attacks on Diversity, Equity, & Inclusion (DE]) and the Freedoms of Higher Education in the State of Florida",
    "sponsor": "Senate President Oscar Santiago Perez, Senate President Pro Tempore Nathan McGinnis, Judiciary Chair Jonathan C. Stephens, Senator Chalisa Budhai, Senator Anghelo Gangano, Senator Ana Alvarez, Senator Cec Wood-Barron, Senator B",
    "author": "LGBTQ+ and Pan-Asian Caucus Chairperson Joaquin Rafaele C. Marcelino, Deputy Majority Party Leader Navya Nair, Majority Party Leader Simone Liang",
    "summary": "Resolution Condemning the Passage of Florida Senate Bill 266 (2023) and the Previous Attempts of Florida House Bill 999 (2023) and their Attacks on Diversity, Equity, & Inclusion (DE]) and the Freedoms of Higher Education in the State of Florida",
    "id": "SSB 2023-1051",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Vacancy Replacement Revision",
    "sponsor": "",
    "author": "Judiciary Committee",
    "summary": "This resolution proposes a revision to Rule XII regarding vacancy replacement in the Student Senate. It outlines the process for announcing and filling vacancies, including the involvement of the Replacement and Agenda Committee and the Information and Communication Committee. The committee will interview all applicants for vacant positions and make recommendations to the Senate. The goal of this revision is to ensure transparency and efficiency in filling Senate vacancies.",
    "id": "SSB 2023-1052",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "BUDGET AND APPROPRIATIONS CRITERIA OF REVIEW ACT (BACORA)",
    "sponsor": "",
    "author": "Senator Jonathan C. Stephens",
    "summary": "The Budget and Appropriations Committee will consist of nine Senators named to the committee by the Senate, one of which will be the Committee Chair. The committee will also have a member of the Student Body appointed as the Budget and Appropriations Committee Clerk. The clerk will serve as the taker of minutes for the committee.",
    "id": "SSB 2023-1053",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Freedom to Run Act",
    "sponsor": "Senator Raj Mia",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "The Freedom to Run Act, authored by Senate President Oscar Santiago Perez, aims to amend the Election Qualification Act to provide greater freedom for candidates to run in student elections. The bill has Senator Raj Mia as its sponsor. If enacted, the bill will allow candidates more flexibility in meeting the qualifications necessary to run for student office. The goal of the bill is to promote inclusivity and ensure that all students have the opportunity to participate in the democratic process of student elections.",
    "id": "SSB 2023-1054",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "VOTING RECORD FORGIVENESS ACT (VRFA)",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Budget and Appropriations Chair Blake Cox, Information and Communications Chair Ethan Ghozali, Minority Party Leader Bronson Allemand, Senator Matt Reich, Senator Zoe Richter, Senator Raj Mia, Judiciary Vice Chair Joaquin Marcelino",
    "author": "Rules and Ethics Chairwoman Lilliana Clark",
    "summary": "This resolution, titled the Voting Record Forgiveness Act (VRFA), proposes amendments to Rule IV to address the attendance of members. The chair of the Rules and Ethics Committee (or their designee) will call the roll of the Senate whenever necessary. The resolution aims to modernize and improve the voting record forgiveness process. It seeks to provide guidelines for excused absences, eliminate outdated language, and establish a clear process for members to request record forgiveness. Overall, the VRFA promotes transparency, accountability, and efficiency within the Student Senate.",
    "id": "SSB 2023-1055",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution in Support of Student Loan Relief",
    "sponsor": "Senate President Pro Tempore Nathan McGinnis, Judiciary Chair Jonathan C. Stephens, Senator Chalisa Budhai, Deputy Majority Party Leader Navya Nair, Majority Party Leader Simone Liang, Senator Colin Lasch, Senator Christian Rodriguez, Senator Raj Mia, Senator Michael Lim, Minority Party Leader Bronson Allemand, Senator Samantha Kinggard, Senator Laurie Wang, Member at Large Johnny Liu, Senator Monish Vijayaraghavan, Budget Chairman Blake Cox, Senator Zoe Nye, Senator Josh Rabinovitz, Senator Jesse Polsky, Senator Jordan Neidenberg, Judiciary",
    "author": "Senator Anghelo Gangano",
    "summary": "Resolution in Support of Student Loan Relief",
    "id": "SSB 2023-1056",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "New Senator Orientation Administration Act — Rules and Procedures Amendment",
    "sponsor": "Judiciary Chair Jonathan Stephens, Minority Party Leader Bronson Allemand, Senate President Oscar Santiago Perez, Senate President Pro-Tempore Nathan McGinnis, Budget Chair Blake Cox, Judiciary Vice Chair Joaquin Marcelino",
    "author": "Information & Communications Chair Ethan Ghozali",
    "summary": "This resolution proposes amendments to the Rules and Procedures of the UF Student Senate, specifically Rule XI regarding the Standing Committees of the Senate. The amendments aim to update the procedures and responsibilities of the Information and Communication Committee. The sponsors of this resolution include Judiciary Chair Jonathan Stephens, Minority Party Leader Bronson Allemand, Senate President Oscar Santiago Perez, Senate President Pro-Tempore Nathan McGinnis, Budget Chair Blake Cox, and Judiciary Vice Chair Joaquin Marcelino.",
    "id": "SSB 2023-1057",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Expulsion Constitutional Alignment and Simplification Act (ECASA) - 300 Codes Revisions",
    "sponsor": "Judiciary Vice Chair Joaquin Marcelino",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "The Expulsion Constitutional Alignment and Simplification Act (ECASA) - 300 Codes Revisions, authored by Senate President Oscar Santiago Perez and sponsored by Judiciary Vice Chair Joaquin Marcelino, aims to streamline and simplify the process of expelling student senators. It includes provisions for filing written charges and outlines the procedure for expulsion in cases of failure to complete constituency requirements.",
    "id": "SSB 2023-1058",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "EXECUTIVE NOMINATION CLARIFICATION ACT — 200 CODES REVISIONS",
    "sponsor": "Judiciary Vice Chair Joaquin Marcelino",
    "author": "Minority Party Leader Bronson Allemand",
    "summary": "The EXECUTIVE NOMINATION CLARIFICATION ACT — 200 CODES REVISIONS bill, authored by Minority Party Leader Bronson Allemand and sponsored by Judiciary Vice Chair Joaquin Marcelino, proposes revisions to Chapter 210 of the EXECUTIVE BRANCH OFFICIALS ESTABLISHMENT AND ACCOUNTABILITY ACT. These revisions clarify the roles and responsibilities of the Executive Branch Officials within the student government at the University of Florida.",
    "id": "SSB 2023-1059",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Voter Record Revision Act",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Senator Michael Lim, Senator Zoe Richter, Senate President Pro Tempore Nathan McGinnis, Judiciary Vice Chair Joaquin Marcelino",
    "author": "Deputy Majority Party Leader Navya Nair",
    "summary": "This bill, titled the Voter Record Revision Act, is authored by Deputy Majority Party Leader Navya Nair and sponsored by Judiciary Chair Jonathan C. Stephens, Senator Michael Lim, Senator Zoe Richter, Senate President Pro Tempore Nathan McGinnis, and Judiciary Vice Chair Joaquin Marcelino. The bill proposes amendments to Rule VII of the Student Senate's voting procedures. The standard voting procedure for all votes requiring a majority will be by voice, while votes requiring a two-thirds, two-fifths, or one-fifth majority will be done by rising vote. The bill aims to streamline and clarify the voting process in the Student Senate.",
    "id": "SSB 2023-1060",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Graduate and Professional Student Summer Vacancy Resolution",
    "sponsor": "",
    "author": "Nathan McGinnis",
    "summary": "On Sunday, I received veto messages for 4 bills that were passed under second readings by the Student Senate. These vetoed pieces of legislation will be heard on Tuesday night under third readings. Legislation under third readings requires a two-thirds vote to override the veto. If an override vote fails, the veto is sustained, and the bill does not go into effect.",
    "id": "SSB 2023-1061",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "",
    "sponsor": "",
    "author": "",
    "summary": "",
    "id": "SSB 2023-1062",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "SSB 2023-1064: Graduate and Professional Student Summer Vacancy R",
    "sponsor": "",
    "author": "",
    "summary": "On Sunday, I received veto messages for 4 bills that were passed under second readings by the Student Senate. These vetoed pieces of legislation will be heard on Tuesday night under third readings. Legislation under third readings requires a two-thirds vote to override the veto. If an override vote fails, the veto is sustained, and the bill does not go into effect.",
    "id": "SSB 2023-1064",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "The Budget Deliberation Act - 800 CODES REVISIONS",
    "sponsor": "",
    "author": "Senator Raj Mia",
    "summary": "The Budget Deliberation Act aims to make revisions to the 800 CODES, specifically Chapter 821, which governs the Big Five Budget Preparation Law. This law has undergone multiple amendments in the past. The Act's objective is to ensure transparency and efficiency in the budget preparation process. It specifically addresses the Activity and Service Fee Budget, which encompasses Recreational Sports, J. Wayne Reitz Union, Student Activities, and other areas. The Act aims to streamline the budget deliberation process and ensure that student funds are allocated appropriately.",
    "id": "SSB 2023-1065",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "General Body Meeting Transparency Act — 800 CODES REVISIONS",
    "sponsor": "Budget and Appropriations Chairman Blake Cox, Budget and Appropriations Vice-Chairman John Brinkman, Senator Kinggard, Senator Ganghano, Senator Alvarez, Senator Lasch, Member-At-Large Ponce",
    "author": "Senator Raj Mia",
    "summary": "The General Body Meeting Transparency Act — 800 CODES REVISIONS bill, authored by Senator Raj Mia, aims to revise Chapter 810 of the Administrative Provisions — Activity and Service Fee Usage Regulations. The bill has multiple sponsors including Budget and Appropriations Chairman Blake Cox, Budget and Appropriations Vice-Chairman John Brinkman, Senator Kinggard, Senator Ganghano, Senator Alvarez, Senator Lasch, and Member-At-Large Ponce. The bill's objective is to ensure transparency in general body meetings and the proper usage of the Student Activity and Service Fee to benefit the Student Body.",
    "id": "SSB 2023-1066",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "",
    "sponsor": "",
    "author": "",
    "summary": "Dear Senate colleagues: 352-392-8072 Fax On Sunday, I received veto messages for 4 bills that were passed under second readings by the Student Senate. These vetoed pieces of legislation will be heard on Tuesday night under third readings. Legislation under third readings requires a two-thirds vote to override the veto. If an override vote fails, the veto is sustained, and the bill does not go into effect. As the Senate President Pro-Tempore, Nathan McGinnis, has already sent out the bills for all to review, I will be sending the veto messages verbatim to you through this means. “SSB 2023-1064: Graduate and Professional Student Summer Vacancy R",
    "id": "SSB 2023-1067",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "CROA - STUDENT GOVERNMENT COMPLIANCE ACT — 800 CODES REVISION",
    "sponsor": "Senator Zoe Richter, Senator Michael Lim, Senator Raj Mia, Deputy Majority Party Leader Navya Nair",
    "author": "Judiciary Chair Jonathan C. Stephens",
    "summary": "This bill, titled CROA - STUDENT GOVERNMENT COMPLIANCE ACT — 800 CODES REVISION, is authored by Judiciary Chair Jonathan C. Stephens. The bill aims to revise Chapter 804 of the Student Government Printing codes, which includes regulations for printed and publicity materials such as brochures, pamphlets, posters, advertisements, programs, handbills, and stationery. The bill is sponsored by Senator Zoe Richter, Senator Michael Lim, Senator Raj Mia, and Deputy Majority Party Leader Navya Nair.",
    "id": "SSB 2023-1068",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "STUDENT GOVERNMENT FOOD EXPENDITURES EXPANSION & DENOTION (SG FEED) ACT",
    "sponsor": "Senator Michael Lim, Senator Navya Nair, Senator Raj Mia, Budget and Appropriations Chairman Blake Cox",
    "author": "Judiciary Chair Jonathan C. Stephens",
    "summary": "CHAPTER 808 ADMINISTRATIVE REGULATIONS - EXTERNAL CONTROL (71-120, 73- 139, 80-223, 82-145, 87-152, 88-106, 88-125, 90-141, 92-123, 93-123, 95-110, 96- 114, 97-103, 97-131, 97-139, 98-128, 2002-140, 2004-119, 2004-107, 2005-101, 2005-106, 2005-122, 2005- 142, 2006-106, 2006-107, 2006-122, 2007-113, 2008-150, Ballot Initiative 2009, 2009-113, 2009-128, 2010-119, 201 1-118, 2012-108, 2014-115, 2015-115, 2016-12",
    "id": "SSB 2023-1070",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "AWARDS RECLASSIFICATION AND CONVENIENCE ACT (ARCA) — 800 CODES REVISION",
    "sponsor": "",
    "author": "Budget and Appropriations Chair Blake Cox",
    "summary": "TITLE: AWARDS RECLASSIFICATION AND CONVENIENCE ACT (ARCA) — 800 CODES REVISION\n\nAUTHOR(S):\nBudget and Appropriations Chair Blake Cox\n\nCHAPTER 810 ADMINISTRATIVE PROVISIONS — ACTIVITY AND SERVICE FEE\nUSAGE REGULATIONS",
    "id": "SSB 2023-1071",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "PROCEDURAL OUTLINE FOR PRORATING ACT (POPA) — 800 CODES REVISION",
    "sponsor": "",
    "author": "Budget and Appropriations Chair Blake Cox",
    "summary": "All student organizations that act i",
    "id": "SSB 2023-1072",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "TRAVEL SPECIFICATION OF DEFINITIONS ACT (TSODA) — 800 CODES REVISION",
    "sponsor": "",
    "author": "Budget and Appropriations Chair Blake Cox",
    "summary": "This bill, authored by Budget and Appropriations Chair Blake Cox, aims to revise the travel specification of definitions act (TSODA) in the 800 codes. The bill focuses on reimbursing expenses related to travel beyond UF's campus, excluding programming events held off campus. The objective is to provide clarity and guidelines for travel reimbursement for UF students.",
    "id": "SSB 2023-1073",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Clerical Addendum Clarification (CAC)",
    "sponsor": "",
    "author": "Budget & Appropriations Vice-Chairman John Brinkman",
    "summary": "This bill, titled Clerical Addendum Clarification (CAC), is authored by Budget & Appropriations Vice-Chairman John Brinkman. The bill pertains to Chapter 800 Finances Generally and Chapter 804 Student Government Printing. It aims to clarify the clerical addendum process within these chapters. The bill does not mention any sponsors. ",
    "id": "SSB 2023-1074",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Event Budget Request Clarification (EBRC)",
    "sponsor": "",
    "author": "Budget & Appropriations Vice-Chairman John Brinkman",
    "summary": "This bill proposes event budget request clarification to ensure accurate and transparent use of student activity and service fees.",
    "id": "SSB 2023-1076",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Honorarium Clarification Act (HCA)",
    "sponsor": "",
    "author": "Budget & Appropriations Vice-Chairman John Brinkman",
    "summary": "The Honorarium Clarification Act (HCA) is a bill authored by Budget & Appropriations Vice-Chairman John Brinkman. It aims to clarify and define the terms related to the use of student body funds, specifically the Activity & Service Fees. The bill provides definitions for Student Body Funds and Activity & Service Fees and outlines that the fees should be expended for lawful purposes that benefit the student body. The HCA seeks to bring clarity and transparency to the allocation and use of student funds.",
    "id": "SSB 2023-1077",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Photographer Limit Clarification (PLC)",
    "sponsor": "",
    "author": "Budget & Appropriations Vice-Chairman John Brinkman",
    "summary": "Student Senate Bill 2023-1079, titled Photographer Limit Clarification (PLC), is authored by Budget & Appropriations Vice-Chairman John Brinkman. The bill clarifies the usage regulations of the Activity and Service Fees, as outlined in Chapter 810 Administrative Provisions. The Student Activity and Service Fee will be expended for lawful purposes to benefit the Student Body in general, in compliance with Florida Statute and Student Body Law. The Student Senate Budget and Appropriations Committee will recommend the allocation of the Activity and Service Fees to the Student Senate. ",
    "id": "SSB 2023-1079",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Amendments to the Agenda Senator Protection Act (AASPA)",
    "sponsor": "Senator Colin Lasch, Senator Matt Reich, Senator Wavid Bowman, Senator Monish Vijayaraghavan, Senator Michael Lim",
    "author": "Budget and Appropriations Chairman Blake Cox",
    "summary": "Amendments to the Agenda Senator Protection Act (AASPA) proposes changes to Rule III of the Senate's Meetings. The regular meetings will be conducted on campus at a consistent time and location. The time and location for regular meetings will be set by the Replacement and Agenda Committee at the beginning of each academic term, with the decision subject to a majority vote of the Senate.",
    "id": "SSB 2023-1083",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Roll Call Quorum Check Clarification Act (RCQCCA)",
    "sponsor": "Senate President Pro-Tempore Nathan McGinnis",
    "author": "Senate President Santiago Perez",
    "summary": "This bill, titled Roll Call Quorum Check Clarification Act (RCQCCA), is authored by Senate President Santiago Perez and sponsored by Senate President Pro-Tempore Nathan McGinnis. It aims to clarify the procedures for roll call and quorum checks in Senate meetings. The bill specifies that the Chair of the Rules and Ethics Committee (or Vice-Chair in the Chair's absence) or their designee will call the roll of the Senate whenever needed. If no members of the Rules and Ethics Committee are present, the Senate President may designate a Senator to perform the roll call. The roll call will occur at the start of every meeting and after every recess. The bill aims to enhance the efficiency and accuracy of roll call and quorum checks in Senate meetings.",
    "id": "SSB 2023-1086",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Quorum Check Expediency and Suspension Act",
    "sponsor": "",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "This bill, titled the Quorum Check Expediency and Suspension Act, is authored by Senate President Oscar Santiago Perez. The bill aims to address the suspension and amendment of the rules in the Senate. It states that the rules may be suspended by a two-thirds vote, provided that no question is pending. However, certain rules cannot be suspended under any circumstances. The bill seeks to ensure efficiency and expediency in Senate proceedings.",
    "id": "SSB 2023-1087",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Chair Roll Call Vote Clarification (CRCVC) Act",
    "sponsor": "",
    "author": "Senate President Oscar Santiago",
    "summary": "This resolution proposes the Chair Roll Call Vote Clarification (CRCVC) Act to clarify the rules regarding roll call votes in the Student Senate. The act specifies that a roll call vote can be ordered by a majority of the Senators present and voting before the next question is spoken on. The roll call will be conducted in accordance with the established rules, with the Chair of the Senate being called last. Senators are allowed to abstain from voting in cases of conflict of interest.",
    "id": "SSB 2023-1088",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Vacancy Definition Clarification Act (VDCA) - 300 Codes Revision",
    "sponsor": "",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "CHAPTER 340 VACANCY REPLACEMENTS (Origin unknown; 68-132, 68-138, 72-108, 72-\n166, 72-193, 73-221, 76-135, 76-201, 76-202, 77-206, 81-112, 82-101, 82-118, 81-\n121, 82-166, 83-123, 84-134, 84-166, Fall Election 1985 Initiative passed 340.72, 86-\n155, 86-156, 87-138, 87-159, 90-133, 90-151, 91-119, 94-114, 94-122, 98-100, 98-\n114, 2000-136, 2001-138, 2005-126, 2006-101, 2007-118, 2008-138, 2015-109, 2020-\n1042, 2021-105)\n\n340.11 Definitions\n1. Vacancy: A vacancy in the Student Senate shall occur upon the resignation,\nremoval, or expulsion, or impeachment of a Student Senator or upon the\nabandonment of the seat by the Student Senator",
    "id": "SSB 2023-1089",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Oath of Office Act - 100 Codes Revision",
    "sponsor": "Senator Anghelo Gangano, Senator Raj Mia",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "All elected Student Body Officials shall be required to take an oath of office as established within this chapter. The Student Senate President and the Student Senate Pro-Tempore shall take this oath of office upon election to their position. Student Senators-elect shall take this oath in the first meeting following the validation of the election results after quorum has been established. The Student Body President-elect, Student Body Vice President-elect and the Student Body Treasurer-elect will take this oath during the Student Government Banquet or on the first day t",
    "id": "SSB 2023-1090",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning Florida Board of Governors’ Decision to Ban Asian Social Media Platforms at Public Universities",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Senator Antonio Hendricks, Member-at-Large Johnny Liu, Senator Bryan Garcia-Ramos, Judiciary Vice-Chair Joaquin R. C. Marcelino, Senator Eric Oh, Senator Anghelo Gangano, Senator Zoe Nye, Information and Communications Vice-Chair Monish Vijayaraghavan, Senator Jeff John, Mental Health Ad-Hoc Chairperson Wavid Bowman, Senator Kishan Nayak, Senator Owen Lekebusch, Senator Ayesha Khuddus, Senator Anamika Naidu, Senator Aron Ali-McClory, Senato",
    "author": "Senator Laurie Wang",
    "summary": "Resolution Condemning Florida Board of Governors’ Decision to Ban Asian Social Media Platforms at Public Universities",
    "id": "SSB 2023-1092",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "A Resolution Recognizing the Outstanding Efforts of Jerome Scott II",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Matthew Reich, Senator Laurie Wang, Senator Saketh Damera, Senate President Oscar Santiago Perez",
    "author": "Senator Raj Mia",
    "summary": "The University of Florida Student Senate recognizes the crucial role played by the Office of Student Government Advising and Operations in ensuring the smooth functioning of the student government. The University of Florida Student Senate acknowledges the dedicated and outstanding efforts of Jerome Scott II, the Associate Director of Student Government Advising and O",
    "id": "SSB 2023-1096",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Office Hour Transparency Act – 200 CODES REVISIONS",
    "sponsor": "Judiciary Chair Joaquin R.C. Marcelino",
    "author": "Senator Raj Mia",
    "summary": "The Office Hour Transparency Act proposes revisions to Chapter 210 of the Student Senate's Executive Branch Officials Establishment Act. The act establishes that the Executive Branch Officials are accountable to the Student Body President, Vice President, and Treasurer. The act also designates the Executive Secretaries as secretaries to the Student Body President on public policy matters.",
    "id": "SSB 2023-1097",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Roll Call Clarity & Transparency Act – 000 Rules & Procedures Amendment",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino",
    "author": "Senator Raj Mia",
    "summary": "This bill, authored by Senator Raj Mia and sponsored by Judiciary Vice-Chair Joaquin R.C. Marcelino, proposes an amendment to Rule IV of the Student Senate's Rules & Procedures. The amendment aims to improve roll call procedures by clarifying that the Chair of the Rules and Ethics Committee (or Vice-Chair in the Chair's absence) or their designee will call the roll of the Senate, and if none are present, the Senate President may designate a Senator to do so. Roll call will occur at the start of every meeting, after every recess, and for any quorum call or roll call vote. Failure to answer a roll call or quorum call will be subject to disciplinary action and may result in a recorded absence.",
    "id": "SSB 2023-1098",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Senate Liaisons Expansion Act",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Saketh Damera, Senator Matthew Reich",
    "author": "Senator Raj Mia",
    "summary": "The Senate Liaisons Expansion Act, authored by Senator Raj Mia, aims to expand the number of Senate Liaisons to the other branches of Student Government and University auxiliaries. The President of the Senate will have the authority to appoint Senate Liaisons, who must hold Senate seats. The Senate Liaisons will serve at the discretion of the President of the Senate and will meet with the President at their convenience. This act enhances communication and collaboration between the Student Senate and other branches of Student Government and University auxiliaries.",
    "id": "SSB 2023-1099",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Senate Secretaries Responsibility Addition Act– 100 CODES",
    "sponsor": "Judiciary Chair Joaquin R.C. Marcelino, Senator Matthew Reich, Senator Laurie Wang, Senator Saketh Damera",
    "author": "Senator Raj Mia",
    "summary": "100.213 The Senate Secretaries shall maintain an updated Microsoft Word document for each code chapter conducive for editing purposes. A copy of the Microsoft Word documents may be forwarded to a senator at their request.",
    "id": "SSB 2023-1100",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "THE FAIR ELECTION REFORM ACT – 700 CODES",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino",
    "author": "Senator Raj Mia",
    "summary": "This bill, titled THE FAIR ELECTION REFORM ACT - 700 CODES, proposes revisions to Chapter 710 - THE SUPERVISOR OF ELECTIONS ACT. The revisions include keeping all polling locations open from 8:30 AM to 9:00 PM on each designated day of the election, and ensuring that all students in line by 8:30 PM are allowed to vote.",
    "id": "SSB 2023-1105",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Election Commission Accountability Act - 700 Codes Revision",
    "sponsor": "Senate President Oscar Santiago Perez, Senator Raj Mia, Majority Party Leader Simone Liang, Senator Anthony Hockman, Judiciary Vice-Chair",
    "author": "Senator Hunter Monson",
    "summary": "The Election Commission Accountability Act - 700 Codes Revision, authored by Senator Hunter Monson, proposes revisions to Chapter 720, The Election Commission Act. The bill aims to ensure accountability by requiring the Elections Commission to keep a written record of all meetings and hearings, including evidence, testimony, findings, and rulings. The bill also establishes a timeline of forty-eight (48) hours for the submission of the written record. The sponsors of the bill include Senate President Oscar Santiago Perez, Senator Raj Mia, Majority Party Leader Simone Liang, Senator Anthony Hockman, and Judiciary Vice-Chair.",
    "id": "SSB 2023-1109",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "THE SGP AND ACCENT INTEGRITY, NEGOTIATION AND TRANSPARENCY (SAINT) ACT",
    "sponsor": "Senator Antonio Hendricks, Majority Party Leader Simone Liang, Minority Party Leader Bronson Allemand",
    "author": "Senator Raj Mia, Judiciary Chair Jonathan C. Stephens",
    "summary": "Student Government Productions, as an agency of Student Government, shall operate under the authority of the Student Body President who shall be empowered to remove from positions those individuals guilty of malfeasance, misfeasance, or nonfeasance.",
    "id": "SSB 2023-1110",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "The Senate Profiles Electronically Logged for Legislators (SPELL) Act",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Anghelo Gangano",
    "author": "Judiciary Chair Jonathan C. Stephens",
    "summary": "The Senate Profiles Electronically Logged for Legislators (SPELL) Act is a Student Senate bill proposed by Judiciary Chair Jonathan C. Stephens. The bill aims to ensure the operation of a roster on the Student Government Website that lists all currently sitting Senators and related vacancies within the University of Florida Student Senate. Each Student Senator's affiliation will be presented next to their name, and they have the option to provide additional information for inclusion on the website. The SPELL Act seeks to enhance transparency and accessibility within the Student Senate.",
    "id": "SSB 2023-1111",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "The Pending Acts, Rules and Mandates (PARM) Act",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Anghelo Gangano",
    "author": "Judiciary Chair Jonathan C. Stephens",
    "summary": "The Senate President shall ensure that the public voting records of Student Senators for all votes on the main question of bills, resolutions, nominations, and appointments are placed online, and that the attendance records of all Student Senators are placed online. Additionally, Senate Secretaries will ensure that Meeting Minute records are placed online. These records shall be posted online within one week of their creation.",
    "id": "SSB 2023-1112",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Funding for Fiscal Year 2024-2025 Activity and Service Fee Budget",
    "sponsor": "Budget and Appropriations Committee",
    "author": "Budget and Appropriations Chairman Blake Cox",
    "summary": "This bill, authored by Budget and Appropriations Chairman Blake Cox, seeks to allocate funding for the Fiscal Year 2024-2025 activity and service fee budget. The total budget for this period is $24,054,701, which includes allocations for Recreational Sports, Reitz Union, Sorority & Fraternity Life, Student Activities & Involvement, and Student Government. The specific breakdown for the Recreational Sports budget includes $6,372,767 for personnel, $857,145 for operations, and $494,764 for ten-year plans.",
    "id": "SSB 2023-1115",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Debate Consideration Reform (DCR) - Rules and Procedures Amendment",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "Senate Bill 2023-1116 proposes an amendment to Rule VI of the Rules Governing Debate. The bill suggests that readings of bills will be by title only, unless specifically requested by a majority of those present and voting. The authors and sponsors of the bill will be given five minutes to present their case, followed by a debate on the bill. The bill aims to streamline the debate process and ensure efficient consideration of bills.",
    "id": "SSB 2023-1116",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Supporting the Creation of an Institute of Asian Pacific Islander and Desi Culture",
    "sponsor": "Pan-Asian Caucus Chairperson Joaquin R.C. Marcelino, Member-at-Large Johnny Liu, Senator Laurie Wang, Senator Samantha Kinggard, Senator Elsa Brantmeyer, Information & Communications Chairman Ethan Ghozali, Senator Julia Seifer, Senator Ayesha Khuddus, Senator Owen Lekebusch, Minority Party Leader Bronson Allemand, Senator Matthew Reich, Senator Bryan Garcia-Ramos, Senator Chalisa Budhai, Senator Anamika Naidu, Senator Nima Aria, Senator Anghelo Gangano, Senator Raj Mia",
    "author": "Senator Saketh Damera, Senator Monish Vijayaraghavan",
    "summary": "Resolution Supporting the Creation of an Institute of Asian Pacific Islander and Desi Culture",
    "id": "SSB 2023-1118",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for the University of Florida to Make Election Day a Holiday",
    "sponsor": "Senator Chalisa Budhai, Senator Raj Mia, Senate President Oscar Santiago Perez",
    "author": "Senator Christian Rodriguez",
    "summary": "The Resolution Advocating for the University of Florida to Make Election Day a Holiday acknowledges the low voter turnout in the United States and the need for increased participation in elections. It highlights that the United States has one of the lowest voter turnout rates among developed countries. The resolution urges the University of Florida to recognize the importance of democracy and civic engagement by making Election Day a holiday. By making Election Day a holiday, the University can encourage students, faculty, and staff to exercise their right to vote and participate in the democratic process. This initiative aims to increase voter turnout and create a more engaged and informed community. ",
    "id": "SSB 2023-1119",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Constituent Transparency Act — Rules and Procedures Codes Revision",
    "sponsor": "Minority Party Leader Bronson Allemand, Information and Communication Chairman Ethan Ghozali, Senator Julia Seifer, Member at Large Johnny Liu",
    "author": "Senator Samantha Kinggard",
    "summary": "This bill, titled the Constituent Transparency Act - Rules and Procedures Codes Revision, is authored by Senator Samantha Kinggard. The bill aims to revise the rules and procedures codes to improve constituent transparency. The sponsors of the bill include Minority Party Leader Bronson Allemand, Information and Communication Chairman Ethan Ghozali, Senator Julia Seifer, and Member at Large Johnny Liu. The bill proposes amendments to Rule XI, which governs the standing committees of the Senate. Specifically, it focuses on the Information and Communication Committee, which is composed of nine Senators. This bill seeks to enhance transparency and communication within the Student Senate.",
    "id": "SSB 2023-1120",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning Florida Senate Bill 256/House Bill 1445 (2023) and their Attacks on Public-Employee Unions",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Senator Antonio Hendricks, Senator Bryan Garcia-Ramos, Senator Asif Islam, Senator Wavid Bowman, Senator Raj Mia, Senator Anamika Naidu, Senate President Oscar Santiago Perez, Senator Colin Lasch, Senate President Pro Tempore Nathan McGinnis, Senator Hunter Monson, Minority Party Leader Bronson Allemand",
    "author": "Senator Anghelo Gangano",
    "summary": "UF\nUNIVERSITY of\nFLORIDA\nStudent Senate 3000 J. Wayne Reitz Union\nPO Box 118505\nGainesville, FL 32611\n352-392-1665\nSTUDENT SENATE BILL 2023-1121\nTITLE: Resolution Condemning Florida Senate Bill 256/House Bill 1445 (2023) and their\nAttacks on Public-Employee Unions\nAUTHOR(S): Senator Anghelo Gangano\nSPONSORS: Judiciary Chair Jonathan C. Stephens, Senator Antonio Hendricks, Senator Bryan\nGarcia-Ramos, Senator Asif Islam, Senator Wavid Bowman, Senator Raj Mia, Senator Anamika\nNaidu, Senate President Oscar Santiago Perez, Senator Colin Lasch, Senate President Pro\nTempore Nathan McGinnis, Senator Hunter Monson, Minority Party Leader Bronson Allemand\nWHEREAS, on May 9th, 2023, Florida Governor Ron DeSantis signed SB 256 into law, taking\neffect on July Ist, 2023 [1]; and,\nWHEREAS, SB 256 forbids",
    "id": "SSB 2023-1121",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning Florida House Bill 1069 and the Censorship, Restriction, and Removal of Educational Resources from Florida Schools",
    "sponsor": "Majority Party Leader Simone Liang, Senator Raj Mia, Senator Bryan Garcia-Ramos, Senator Anamika Naidu, Senator Christian Rodriguez, Senator Chalisa Budhai, Senator Antonio Hendricks, Senator Cec Wood-Barron, Senator Colin Lasch, Senate President Pro Tempore Nathan McGinnis, Senator Hunter Monson, Senate President Oscar Santiago Perez",
    "author": "Senator Anghelo Gangano",
    "summary": "On June 8th, 2023, President Joe Biden announced the appointment of a new point person at the Department of Education to address an increase in book bans. The American Library Association reported in 2022 that there has been a significant increase in incidents of book censorship and removal of educational resources in schools across the country. This resolution condemns Florida House Bill 1069 and the censorship, restriction, and removal of educational resources from Florida schools. The Student Senate believes that the free exchange of ideas and access to diverse educational resources are fundamental to a well-rounded education. The Student Senate urges the Florida House of Representatives to reject House Bill 1069 and to support policies that promote intellectual freedom and academic integrity in Florida schools.",
    "id": "SSB 2023-1122",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Senate Newsletter Act - Rules and Procedures Amendment",
    "sponsor": "Senator Chalisa Budhai, Senate President Pro-Tempore Nathan McGinnis, Senator Anghelo Gangano, Senator Bryan Garcia-Ramos, Judiciary Chairperson Jonathan Stephens, Judiciary Vice-Chair Joaquin Marcelino, Senator Raj Mia, Senator Hunter Monson, Senator Cec Wood-Barron, Senator Aron Ali-McClory, Senator Antonio Hendricks, Senator John Rassel, Senator Kishan Nayak, Senator Ana Alvarez",
    "author": "Majority Party Leader Simone Liang",
    "summary": "UF UNIVERSITY of FLORIDA Student Senate presents the Senate Newsletter Act - Rules and Procedures Amendment. The bill, authored by Majority Party Leader Simone Liang, is sponsored by multiple senators including Chalisa Budhai, Nathan McGinnis, Anghelo Gangano, Bryan Garcia-Ramos, Jonathan Stephens, Joaquin Marcelino, Raj Mia, Hunter Monson, Cec Wood-Barron, Aron Ali-McClory, Antonio Hendricks, John Rassel, Kishan Nayak, and Ana Alvarez. The amendment focuses on Rule XI, which pertains to the standing committees of the Senate. The purpose of this amendment is to update and improve the rules and procedures related to the Senate Newsletter. The Student Senate aims for better communication and transparency through this proposed amendment.",
    "id": "SSB 2023-1123",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Addressing the Environmental Risks Associated with Phosphate Mining and Phosphogypsum Storage in the State of Florida",
    "sponsor": "Senate President Oscar Santiago Perez, Senate President Pro Tempore Nathan McGinnis, Senator Raj Mia, Senator Anghelo Gangano, Senator Samantha Kinggard, Senator Julia Seifer, Senator Eric Oh, Senator Saketh Damera, Senator Isabel Ponce, Minority Party Leader Bronson Allemand, Senator Owen Lekebusch, Deputy Majority Party Leader Joaquin R.C. Marcelino, Senator Kaavya Polavarapu, Senator Julian Villarta, Senator Danielle Haddad, Senator Vivianett Avila, Senator Laurel Wentwo",
    "author": "Senator Zoe Richter",
    "summary": "Resolution Addressing the Environmental Risks Associated with Phosphate Mining and Phosphogypsum Storage in the State of Florida",
    "id": "SSB 2023-1124",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Addressing the Need for Charging Stations in the Reitz Union",
    "sponsor": "Senator Monish Vijayaraghavan, Senator Owen Lekebusch, Senator Laurie Wang, Senator Amanda Lieber, Senator Saketh Damera, Member at Large Johnny Liu, Senator Ayesha Khuddus, Budget and Appropriations Chairman Blake Cox, Member at Large Isabel Ponce, Minority Party Leader Bronson Allemand",
    "author": "Senator Julia Seifer, Samantha Kinggard",
    "summary": "The J. Wayne Reitz Union is a multifaceted hub of student life on campus that enhances the Gator student experience by creating purposeful, proactive, and unique opportunities for learning, leadership, and education.",
    "id": "SSB 2023-1127",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Addressing the Need for Physical Directories to Essential Locations on Campus",
    "sponsor": "Rules and Ethics Chairwoman Lilliana Clark, Senator Laurie Wang, Budget and Appropriations Chairman Blake Cox, Minority Party Leader Bronson Allemand, Member at Large Johnny Liu, Member at Large Isabel Ponce",
    "author": "Senator Julia Seifer, Senator Samantha Kinggard",
    "summary": "The University of Florida Student Senate proposes a resolution to address the need for physical directories to essential locations on campus. With a population of 55,781 students, many of whom live on campus or in surrounding areas, the university's campus spans 22 acres of land. A physical directory would provide a quick and convenient reference for students to locate important buildings and resources on campus. The resolution is supported by Senator Julia Seifer, Senator Samantha Kinggard, and sponsored by Rules and Ethics Chairwoman Lilliana Clark, Senator Laurie Wang, Budget and Appropriations Chairman Blake Cox, Minority Party Leader Bronson Allemand, Member at Large Johnny Liu, and Member at Large Isabel Ponce.",
    "id": "SSB 2023-1128",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Religious Absences Expungement Consideration (RAEC) Act - 300 Codes Revision",
    "sponsor": "CHAPTER 323 SENATE ATTENDANCE (73-150, 74-133, 75-182, 76-204, 76-206, 76-245, 77- 118, 80-180, 81-112, 82-177, 82-122, 82-170, 83-111, 83-115, 88-133, 94-114, 97-108, 98-100, 98-119, 2000-146, 2002-128, 2002-159, 2004-127, 2005-123. 2006-125, 2007-144, 2008-118, 2008-129, 2011-117, 2012-102, 2014-111, 2015-109, 2020-1022, 2020-1042, 2020-1066)",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "During the Summer A and Summer B terms, if a Student Senator accumulates two (2) unexcused or three (3) combined absences (excused or unexcused) from the Student Senate, it shall constitute resignation by non-attendance. During the Fall and Spring terms, if a Student Senator accumulates more than two unexcused or three combined absences, they shall be considered a resignation from the Student Senate.",
    "id": "SSB 2023-1130",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Proposal to Eliminate the Defunct Student Honor Court - Constitutional Amendment",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin Rafaele C. Marcelino, Senator Matthew Reich, Senator Saketh Damera, Senator Laurie Wang",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "Proposal to eliminate the defunct Student Honor Court by amending the Student Body Constitution. The amendment includes striking sections 4 and 5 of Article V and section 2(c) of Article V. This amendment will be submitted to the electors for ratification or rejection at the general election in Spring 2024.",
    "id": "SSB 2023-1132",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Fall 2023 Apportionment Realignment Act (FARA)",
    "sponsor": "Majority Party Leader Simone Liang, Senator Aron Ali-McClory, Senator Raj Mia",
    "author": "Ad-Hoc Committee On Fall 2023 Apportionment Realignment",
    "summary": "This bill, known as the Fall 2023 Apportionment Realignment Act (FARA), aims to realign the apportionment for the Fall 2023 session. It is authored by the Ad-Hoc Committee On Fall 2023 Apportionment Realignment, with sponsorship from Majority Party Leader Simone Liang, Senator Aron Ali-McClory, and Senator Raj Mia. The bill proposes changes to Chapter 322 Apportionment, covering various previous acts such as 67-107, 72-118, 72-172, and many others. The goal of this bill is to ensure fair and accurate apportionment for the Fall 2023 session.",
    "id": "SSB 2023-1133",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "An Act Enumerating Student Government Services - 500 Codes Revision",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino",
    "author": "Mental Health Committee Co-Chair Wavid Bowman",
    "summary": "CHAPTER 503 - STUDENT GOVERNMENT SERVICES. 503.1 \"Student Government Service\" is defined as a subsidiary Student Government organization which provides services that promote enrichment in safety, entertainment, health, professional skills and personal development. 503.2 Student Government Services enumerated in section 503.5 are not intended to be a complete list of Student Government Services. 503.3 The funding for Student Government Services will be decided in the Activities and Service Fees Budget.",
    "id": "SSB 2023-1136",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "The Absentee Ballot Information and Accountability Act",
    "sponsor": "Senator Chalisa Budhai, Senator Asif Islam, Majority Party Leader Simone Liang, Senator Raj Mia, Senator Anghelo Gangano, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Aron Ali-McClory",
    "author": "Senator Christian Rodriguez",
    "summary": "The Absentee Ballot Information and Accountability Act, authored by Senator Christian Rodriguez, seeks to amend Chapter 710 - The Supervisor of Elections Act. The bill aims to enhance the absentee ballot process by imposing stricter accountability measures. The proposed amendments include provisions for increased transparency, improved voter education, and more stringent requirements for absentee ballot application and verification. By enacting this act, the Student Senate aims to ensure the integrity and efficiency of the absentee voting system within the university.",
    "id": "SSB 2023-1138",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "The Accountability of Acts Act (AAA)",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Chalisa Budhai",
    "author": "Senator Christian Rodriguez",
    "summary": "The Accountability of Acts Act (AAA) is a bill authored by Senator Christian Rodriguez. The bill aims to amend Rule XI, which governs the standing committees of the Student Senate. Specifically, it focuses on the Replacement and Agenda Committee, outlining its composition and responsibilities. The committee will include the Senate President Pro Tempore as chair, the Senate President, the leaders of each political party or coalition, two Senate Members-At-Large, and a member of the Student Body. The AAA bill seeks to enhance accountability and efficiency in the Student Senate's committee structure.",
    "id": "SSB 2023-1139",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "The Supreme Court Syllabus Act",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Chalisa Budhai",
    "author": "Senator Christian Rodriguez",
    "summary": "The Student Senate enacts the Supreme Court Syllabus Act to authorize the creation of syllabi that simplify complex Supreme Court opinions and make them more accessible to the student body.",
    "id": "SSB 2023-1140",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "THE FREEDOM OF ELECTION DATA (FED) ACT – 700 CODES REVISIONS",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Bryan Garcia-Ramos, Senator Asif Islam, Senator Kaavya Polavarapu, Senator Anghelo Gangano, Senator Christian Rodriguez, Majority Party Leader Simone Liang, Senator Raj Mia, Senator Cec Wood-Barron",
    "author": "Senator Anamika Naidu",
    "summary": "The Freedom of Election Data (FED) Act proposes revisions to Chapter 760 - The Election Campaign Act. The act aims to enhance the freedom and integrity of elections by modifying 700 codes related to election campaigns. The bill is authored by Senator Anamika Naidu and sponsored by Judiciary Chair Jonathan C. Stephens and others. The revisions aim to improve the transparency, fairness, and accuracy of election data. The act will be an important step towards ensuring a democratic electoral process.",
    "id": "SSB 2023-1141",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for Greater Civic Engagement Initiatives for Students at the University of Florida",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Chalisa Budhai, Senator Christian Rodriguez, Senator Anthony Hockman, Senator Raj Mia, Senator Anamika Naidu, Senator Kaavya Polavarapu",
    "author": "Majority Party Leader Simone Liang",
    "summary": "The Student Senate Bill 2023-1142, titled 'Resolution Advocating for Greater Civic Engagement Initiatives for Students at the University of Florida,' encourages students to actively participate in addressing community issues. The resolution highlights civic engagement as actions taken by individuals such as voting, volunteering, and activism. By promoting community decision-making and fostering democratic processes, civic engagement contributes to a stronger and more inclusive community at the University of Florida.",
    "id": "SSB 2023-1142",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Committee Recording Transparency Act (CRTA) - Rules and Procedures Amendment",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino Senator Christian Rodriguez, Senator Anamika Naidu",
    "author": "Majority Party Leader Simone Liang",
    "summary": "Amendment to Rule XI of the Student Senate's Standing Committees of the Senate. The amendment requires the Replacement and Agenda Committee to announce all open chair positions of standing committees in their report to the Senate. Senators seeking the Chair of a standing committee must submit a request for consideration. The amendment aims to bring transparency to the process of appointing Chairs of standing committees.",
    "id": "SSB 2023-1143",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Committee Responsibility Recording Transparency Act (CRRTA) - 300 Codes Revisions",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino",
    "author": "Majority Party Leader Simone Liang",
    "summary": "The standing committees of the Student Senate shall follow all guidelines as set in the Senate Rules and Procedures. Senate Rules and Procedures shall not overrule any guidelines enumerated herein or elsewhere within Student Body Statutes. The Senate Committee Chairpersons, or their designee, are required to record all business of the committee each meeting in",
    "id": "SSB 2023-1144",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Recognizing the Need for Finals Week De-Stress Events for Students",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Matthew Reich, Senator Saketh Damara, Senator Laurie Wang, Senator Samantha Kinggard, Senator Charlotte Russo, Senator Julia Seifer, Senator Nathan Patrick, Member-at-Large Johnny Liu",
    "author": "Senator Owen Lekebusch, Senator Jillian Sparkman",
    "summary": "WHEREAS, “Finals Week” refers to a period when most courses schedule their final exams, centering around mid-December for the Fall semester and late April into May for the Spring, per the University of Florida 2023-2024 Academic Calendar [1]; and, WHEREAS, in a 2022 survey conducted by the American Addiction Centers, the most commonly sha",
    "id": "SSB 2023-1146",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "THE STUDENT PERFORMER OPPORTUNITIES AND ACCOLADES (SPOA) ACT",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino",
    "author": "Senator Raj Mia, Judiciary Chair Jonathan C. Stephens",
    "summary": "CHAPTER 220 STUDENT GOVERNMENT PRODUCTIONS (69-112, 69-115, 71-118, 71-140, 72-161, 91103, 96-127, 98-100, 2003-125, 2006-133, 2007-129, 2014-112, 2016-105, 2021-115) 220.1 Student Government Productions, as an agency of Student Government, shall operate under the authority of the Student Body President who shall be empowered to remove from positions those individuals guilty of malfeasance, misfeasance, or nonfeasance. 220.11 A member of Student Government Productions may also be removed by following the procedures as outlined Chapter 306 and 307, S.B.S. 220.2 Student Gove",
    "id": "SSB 2023-1147",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "PROVISO CLARIFICATION INITIATIVE",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino",
    "author": "Judiciary Chair Jonathan C. Stephens",
    "summary": "",
    "id": "SSB 2023-1148",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "AUTHORIZATION ORDERING SENATE BUDGETARY FUNDS TOWARDS ESTABLISHING THE EMERGENCY CONTRACEPTIVE VENDING MACHINE PROJECT",
    "sponsor": "Mental Health Co-Chairperson Wavid Bowman, Senator Asif Islam, Senator Anamika Naidu, Senator Anghelo Gangano",
    "author": "Senator Isabella Scramoncin",
    "summary": "Students at the University of Florida have demanded for many years the installation of a contraceptive vending machine on campus to support students' reproductive rights. With 57% of undergraduate students being females, this project aims to address the need for accessible contraceptives. The Student Senate is authorizing the allocation of budgetary funds towards establishing the Emergency Contraceptive Vending Machine Project.",
    "id": "SSB 2023-1151",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "AUTHORIZATION ORDERING SENATE BUDGETARY FUNDS TOWARDS ESTABLISHING THE STUDENT GOVERNMENT REGIONAL TRANSIT SYSTEM APPLICATION PROJECT",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Majority Party Leader Simone Liang, Senator Raj Mia, Senator Nima Aria, Senator Christian Rodriguez, Senator Anghelo Gangano, Senator Danielle Hadad, Mental Health Committee Co-Chair Wavid Bowman",
    "author": "Senator Asif Islam",
    "summary": "Many students at the University of Florida, and many residents who reside in Gainesville at large, have leveled complaints about the RTS (Regional Transit System) app for a number of reasons, including but not limited to: the fact that it is poorly optimized, it tends to crash a lot, and it is not functional on all devices",
    "id": "SSB 2023-1152",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for Increased Access to Resources for Transfer Students at the University of Florida",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Matthew Reich, Senator Saketh Damara, Senator Laurie Wang",
    "author": "Senator Claudia Garcia",
    "summary": "Transfer students make up nearly 40 percent of all college students but often face barriers and lack access to resources. The University of Florida Student Senate recognizes the need to increase efforts in providing transfer students with access to resources, opportunities, and information. This resolution aims to advocate for improved access and awareness for transfer students at the University of Florida.",
    "id": "SSB 2023-1153",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Addressing the Need for Crosswalks Across Southwest 35th Place and Southwest 23rd Street",
    "sponsor": "Senate President Pro-Tempore Nathan McGinnis, Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Majority Party Leader Simone Liang, Senator Raj Mia, Senator Chalisa Budhai, Senator Anghelo Gangano, Senator Saketh Damara",
    "author": "Senate President Oscar Santiago Perez",
    "summary": "WHEREAS, pedestrian safety has been an important effort for the University of Florida and Gainesville community; and, WHEREAS, the University of Florida Student Senate has approved multiple resolutions advocating for the development of crosswalks around campus and near student populations [1]; and, WHEREAS, Southwest 35th Place is a road adjacent t",
    "id": "SSB 2023-1154",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Requesting Exercise Classes to Promote Mental Health and Wellness in Student Recreation Centers",
    "sponsor": "Member at Large Isabel Ponce, Senator Monish Vijayaraghavan, Senator Eric Oh, Senator Samantha Kinggard, Senator Laurie Wang, Senator Owen Lekebusch, Senator Saketh Damara, Senator Matthew Reich",
    "author": "Senator Jillian Sparkman, Senator Jordan Neidenberg",
    "summary": "Mental health issues have become increasingly prevalent among college students, with up to 44% of college students reported having symptoms of depression and anxiety. The COVID-19 pandemic has added to the stress and anxiety experienced by students, further emphasizing the importance of mental health support. Physical exercise has been scientifically proven to have positive effects on mental well-being, including reducing symptoms of depression and anxiety. This resolution requests the implementation of exercise classes in student recreation centers to promote mental health and wellness among college students. The classes would aim to provide accessible and diverse exercise options to cater to the diverse needs and preferences of students. By creating opportunities for students to engage in physical activity, the resolution aims to support their mental well-being and overall quality of life.",
    "id": "SSB 2023-1155",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for Increased Outdoor Recreation Spaces for Students",
    "sponsor": "Minority Party Leader Bronson Allemand, Senator Monish Vijayaraghavan, Senator Owen Lekebusch, Senator Julia Seifer, Senator Claudia Garcia, Senator Samantha Kinggard, Senator Eric Oh, Senator Elsa Brantmeyer, Senator Saketh Damara, Senator Matthew Reich",
    "author": "Senator Nathan Patrick, Senator Paige Kleppe",
    "summary": "The University of Florida Student Senate recognizes the importance of outdoor recreation spaces in promoting physical fitness, mental well-being, and a sense of community among students and staff. As part of its commitment to creating a healthy and inclusive campus environment, the Student Senate advocates for increased outdoor recreation spaces. These spaces play a vital role in encouraging physical activity and fostering social interaction. By advocating for the expansion of outdoor recreation spaces, the Student Senate aims to enhance the overall well-being of the university community.",
    "id": "SSB 2023-1156",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Recognizing the Need for Access to Hydration Resources on Campus",
    "sponsor": "Rules and Ethics Chairwoman Lilliana Clark, Senator Monish Vijayaraghavan, Senator Ayesha Khuddus, Senator Owen Lekebusch, Member at Large Isabel Ponce, Senator Samantha Kinggard, Senator Julia Seifer",
    "author": "Senator Paige Kleppe, Senator Elsa Brantmeyer",
    "summary": "Dehydration can lead to significant health problems, including fatigue, headaches, and decreased physical performance. Student athletes, recreational sports participants, and physically active individuals at the University of Florida require proper hydration to perform optimally and maintain their health. The resolution recognizes the need for access to hydration resources on campus to support the well-being and athletic performance of the UF community.",
    "id": "SSB 2023-1157",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for the Expansion of University-Funded access to Paywall Blocked Resources for Students",
    "sponsor": "Senator Monish Vijayaraghavan, Senator Owen Lekebusch, Member at Large Isabel Ponce, Senator Julia Seifer, Senator Samantha Kinggard",
    "author": "Senator Charlotte Russo, Senator Elsa Brantmeyer",
    "summary": "In today's rapidly changing global landscape, access to current events and the latest research is essential for a well-rounded education. Many reputable news outlets and academic journals restrict access to content behind paywalls, limiting the ability of students to engage with vital information. The University of Florida currently provides access to certain academic journals and resources, but does not e",
    "id": "SSB 2023-1158",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Political Affiliation Realignment Technical Initiative (PARTI)",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Anghelo Gangano, Minority Party Leader Bronson Allemand, Majority Party Leader Simone Liang",
    "author": "Senate President Pro Tempore Nathan McGinnis, Senator Raj Mia",
    "summary": "Amendment to Rule XVII: Political Parties. All new Senators must indicate their party affiliation when submitting their information forms to the Senate office. Senators may choose to affiliate with any political party that has participated won a seat in a Student Government.",
    "id": "SSB 2023-1159",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Calling for the University of Florida to Inform Students of University Policies Which Allow Them to Observe Religious Holidays Without Fear of Academic Consequences",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Samantha Kinggard, Minority Party Leader Bronson Allemand, Senator Owen Lekebusch, Senator Laurie Wang, Member at Large Isabel Ponce, Senator Monish Vijayaraghavan, Senator Ayesha Khuddus, Senator Paige Kleppe, Senator Saketh Damara",
    "author": "Senator Julia Seifer, Senator Matthew Reich",
    "summary": "This resolution calls for the University of Florida to inform students of university policies that allow them to observe religious holidays without facing academic consequences. It was inspired by the advocacy of individuals, including Maya Idiculla. The resolution recognizes the importance of religious freedom and aims to ensure that students have the ability to practice their religious beliefs without fear of negative academic impacts. ",
    "id": "SSB 2023-1160",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Calling on University Administration to Donate Unused Flex Bucks to the Field and Fork Pantry",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Samantha Kinggard, Minority Party Leader Bronson Allemand, Senator Owen Lekebusch, Senator Laurie Wang, Member at Large Isabel Ponce, Senator Monish Vijayaraghavan, Senator Saketh Damara",
    "author": "Senator Julia Seifer, Senator Matthew Reich",
    "summary": "Food insecurity is defined as lacking consistent access to 'enough food for an active, healthy life,' largely resulting from inadequate financial resources for food. Food insecure individuals struggle with a multitude of overlapping issues, such as low income, lack of affordable housing, and health problems. To address this issue on campus, this resolution calls on the university administration to donate unused flex bucks from student meal plans to the Field and Fork Pantry. By redirecting these funds, the university can help provide food assistance to students facing food insecurity and contribute to a more inclusive and supportive campus community.",
    "id": "SSB 2023-1161",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Requesting Student Legal Services to Assist Students with Immigration Services",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Rules and Ethics Chairwoman Lilliana Clark, Senator Samantha Kinggard, Senator Claudia Garcia, Senator Ayesha Khuddus, Senator Owen Lekebusch, Member at Large Isabel Ponce, Senator Elsa Brantmeyer, Senator Julia Seifer, Senator Laurie Wang, Senator Saketh Damara, Senator Matthew Reich",
    "author": "Senator Eric Oh, Senator Monish Vijayaraghavan",
    "summary": "The University of Florida Student Senate requests the assistance of Student Legal Services to provide support and services to international students regarding immigration matters. This resolution recognizes the significant contributions of international students to the campus community and acknowledges the challenges they often face in navigating complex immigration procedures. By providing access to legal resources, Student Legal Services aims to assist international students in their immigration needs and promote a more inclusive and supportive environment.",
    "id": "SSB 2023-1162",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Condemning the Recent Decision to Ban AP Psychology in Florida Schools",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Monish Vijayaraghavan, Senator Claudia Garcia, Senator Samantha Kinggard, Senator Owen Lekebusch, Member at Large Isabel Ponce, Senator Paige Kleppe, Senator Elsa Brantmeyer, Senator Saketh Damara, Senator Laurie Wang, Senator Matthew Reich",
    "author": "Gator Party Leader Bronson Allemand",
    "summary": "Advanced Placement (AP) courses provide students with opportunities to explore college-level studies while in high school, fostering skills needed for higher education. AP Psychology has been a part of Florida's high school curriculum for three decades, providing an essential understanding of human behavior and mental processes. However, the recent decision to ban AP Psychology in Florida schools undermines the academic progress and restricts the educational choices available to students. This resolution condemns the decision and advocates for the continuation of AP Psychology as an integral part of the high school curriculum in Florida.",
    "id": "SSB 2023-1163",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Requesting Increased Accessibility of Football Tickets for Students",
    "sponsor": "Senator Monish Vijayaraghavan, Senator Claudia Garcia, Senator Samantha Kinggard, Senator Owen Lekebusch, Senator Elsa Brantmeyer, Senator Julia Seifer, Member at Large Isabel Ponce, Senator Eric Oh",
    "author": "Gator Party Leader Bronson Allemand, Senator Nathan Patrick",
    "summary": "Attending sporting events, such as football games, is an integral part of the university experience, fostering a sense of community and school spirit among students. Many students face financial constraints and challenges in acquiring tickets to football games, with limited availability making it difficult for many students to attend these events.",
    "id": "SSB 2023-1164",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Requesting the Creation of a LGBTQ+ Institute",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Laurie Wang, Senator Owen Lekebusch, Senator Monish Vijayaraghavan",
    "author": "Minority Party Leader Bronson Allemand, Senator Julia Seifer",
    "summary": "The University of Florida Student Senate requests the creation of a LGBTQ+ Institute to support and empower LGBTQ+ students on campus. This institute aims to provide resources, programming, and a safe space for the LGBTQ+ community at UF. Building upon the existing institutes for Hispanic and Latinx culture, Black culture, and inclusion, the LGBTQ+ Institute will contribute to a diverse and inclusive campus environment. It symbolizes UF's commitment to fostering understanding, respect, and acceptance of all individuals, regardless of sexual orientation or gender identity.",
    "id": "SSB 2023-1165",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Senate Parliamentarian Modernization Act – 000 Codes Revision",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino",
    "author": "Gator Party Leader Bronson Allemand, Majority Party Leader Simone Liang",
    "summary": "Senate Parliamentarian Modernization Act – 000 Codes Revision aims to revise and modernize Rule I of the Student Senate, which governs the officers of the Senate. The bill proposes amendments to improve the appointment process of the Senate Parliamentarian. The President of the Student Senate has the authority to appoint the Senate Parliamentarian, and if the office becomes vacant, the President Pro Tempore will perform the duties. The bill also ensures that the Senate Parliamentarian is considered an exclusionary office in accordance with the Student Body Statutes. The objective of the bill is to enhance the functioning and efficiency of the Student Senate.",
    "id": "SSB 2023-1166",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "RESOLUTION FOR THE URGENT NEED TO ESTABLISH THE CREATIVE ARTS NEEDS AND VALUES ACCESSIBILITY SERVICES (CANVAS) PROJECT",
    "sponsor": "Majority Party Leader Simone Liang, Senator Zoe Richter, Senator Raj Mia, Senator Asif Islam, Senator Anghelo Gangano, Senator Anthony Hockman, Senator Julia Seifer, Budget Chairman Blake Cox, Senator Chalisa Budhai",
    "author": "Senator Cec Wood-Barron",
    "summary": "With reference to SSB 2022-1067- Resolution Addressing Professional Resources and Critical Needs for Arts Students at the University of Florida, written by former Senator Cassie Urbenz and Senator Evan E. Rafanan, the University of Florida’s Student Senate unanimously passed the bill stating “Student Senate advocates for further expansion and innovative programs to support the needs of the arts students at the University of Florida.” The Creative Arts Needs and Values Accessibility Services (CANVAS) Project aims to establish an accessible and inclusive environment that supports the unique needs of arts students at the University of Florida. The project focuses on providing resources, programs, and services that enhance the academic, social, and emotional well-being of arts students. The CANVAS project also aims to promote diversity, equity, and inclusion within the arts community at the University of Florida.",
    "id": "SSB 2023-1167",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution recognizing the need for Food Delivery Waivers during the Final Examination Period",
    "sponsor": "Senator Samantha Kinggard, Senator Claudia Garcia, Member at Large Isabel Ponce, Senator Julia Seifer, Senator Elsa Brantmeyer",
    "author": "Senator Monish Vijayaraghavan, Senator Ayesha Khuddus, Senator Owen Lekebusch, Senator Paige Kleppe",
    "summary": "Many university students fail to follow a well-balanced, consistent meal plan when preparing for their final exams. A survey conducted on stress in college displayed more than 89% of respondents said they felt stress from exams, and nearly 74% said studying brought them stress. Nutrition plays a vital role in the promotion of overall health and well-being, especially for indiv",
    "id": "SSB 2023-1168",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for the Implementation of the Federal Open Textbook Pilot Program at the University of Florida",
    "sponsor": "Judiciary Vice-Chair Joaquin R.C. Marcelino",
    "author": "Senator Matthew Reich, Senator Ryan Harrell",
    "summary": "As of 2022, the average college textbook costs an estimated $105.37. One-quarter of students reported having to work extra hours to pay for their textbooks. The Federal Open Textbook Pilot program aims to support projects at institutions of higher education that create and expand the use of open textbooks to achieve savings for students.",
    "id": "SSB 2023-1169",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "A Resolution Condemning the Practice of Conversion Therapy",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Senator Anghelo Gangano, Senator Raj Mia, Senator Chalisa Budhai, Senator Nima Aria, Senator Cec Wood-Barron",
    "author": "LGBTQ+ Caucus Chairperson & Judiciary Vice Chair Joaquin R. C. Marcelino, Senate President Oscar Santiago Perez",
    "summary": "The Student Senate condemns the practice of conversion therapy, which involves attempts to change an individual's sexual orientation or sexual behaviors, including their gender identity. Such practices may include aversive conditioning methods and psychotherapy techniques. The American Medical Association has recognized that conversion therapy is not effective and poses significant risks to the mental and physical health of those subjected to it. The Senate acknowledges the importance of upholding the rights and well-being of LGBTQ+ individuals and advocates for the banning of conversion therapy nationwide.",
    "id": "SSB 2023-1170",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "Resolution Advocating for the Consideration of a New Crosswalk Across Gale Lemerand Drive Near the New Physics Building",
    "sponsor": "Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Matthew Reich, Senator Saketh Damara, Senator Laurie Wang",
    "author": "Senator Bryan Garcia-Ramos",
    "summary": "The City of Gainesville has experienced incidents of pedestrian injury and fatality. In 2021, Alachua County reported 161 motor vehicle crashes involving pedestrians, resulting in 122 injuries and 12 fatalities. This resolution advocates for the consideration of a new crosswalk across Gale Lemerand Drive near the New Physics Building to improve pedestrian safety. The sponsor list includes Judiciary Chair Jonathan C. Stephens, Judiciary Vice-Chair Joaquin R.C. Marcelino, Senator Matthew Reich, Senator Saketh Damara, and Senator Laurie Wang.",
    "id": "SSB 2023-1171",
    "status": "TBD",
    "verified": false
  },
  {
    "title": "A Resolution Condemning the Actions and Rhetoric of Florida Governor Ron DeSantis",
    "sponsor": "Senate President Oscar Santiago Perez, Senate President Pro Tempore Nathan McGinnis, Judiciary Chairperson Jonathan Chance Stephens, Majority Party Leader Simone Liang, Deputy Majority Party Leader Joaquin R. C. Marcelino, Senator Hunter Monson, Senator Cec Wood-Barron, Senator Asif Islam, Senator Anghelo Gangano, Senator Zoe Richter, Senator Aron Ali-McClory, Senator Bryan Garcia-Ramos, Senator Isabella Scramoncin, Senator Raj Mia, Senator Danielle Haddad, Senator Ryan Athay",
    "author": "Senator Christian Isaiah Rodriguez, Senator Chalisa Kalyani Budhai",
    "summary": "Ron DeSantis was elected to be the governor of Florida and represent the needs of all Floridians, but his actions and rhetoric have demonstrated a disregard for the values and principles that we hold dear. This resolution condemns his actions and rhetoric and calls for him to be held accountable for his divisive and harmful behavior. We urge the citizens of Florida to join us in speaking out against his actions and working towards a more inclusive and compassionate state.",
    "id": "SSB 2023-1174",
    "status": "TBD",
    "verified": false
  }
]